[
    {
        "case_id": "RL-0998",
        "original_report": "microscopy: I esophageal biopsies: gastric cardia-type mucosa with intestinal metaplasia and a picture best classified as low-grade dysplasia. II and III esophageal biopsies: gastric cardia-type mucosa with intestinal metaplasia and reactive changes, no dysplasia. IV esophageal biopsies: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes, no dysplasia.\n\nconclusion: I-IV esophageal biopsies show gastric cardia-type mucosa with intestinal metaplasia. I contains findings classified as low-grade dysplasia. II, III, and IV biopsies show reactive changes without dysplasia.\n\nbarrett_label: LGD",
        "generated_report": "microscopy: I shows fragments of gastric cardia-type mucosa with intestinal metaplasia and mild to moderate chronic inflammation. Locally, there is a preference for high-grade dysplasia.\n\nconclusion: I and IV esophageal biopsies: columnar mucosa with intestinal metaplasia and reactive epithelial changes. III esophageal biopsies: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. III esophageal biopsies: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. III esophageal biopsies: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. III and III esophageal biopsies: columnar mucosa with intestinal metaplasia and reactive epithelial changes. III esophageal biopsies: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. III and III esophageal biopsies: columnar mucosa with intestinal metaplasia and reactive epithelial changes. IV esophageal biopsies: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. IV esophageal biopsies: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. IV esophageal biopsies: columnar mucosa with intestinal metaplasia and reactive epithelial changes. IV esophageal biopsies: columnar mucosa with intestinal metaplasia and reactive epithelial changes. IV esophageal biopsies: columnar mucosa with intestinal metaplasia and reactive epithelial changes. IV esophageal biopsies: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. No dysplasia is identified.\n\nbarrett_label: LGD",
        "report_extracted_label": "LGD"
    },
    {
        "case_id": "RL-0999",
        "original_report": "microscopy: II shows fragments of gastric-type mucosa with mild chronic inflammation, no intestinal metaplasia, and no dysplasia. \nIII shows fragments of gastric cardia-type mucosa with moderately extensive intestinal metaplasia, mild chronic inflammation, and a reactive cell picture. \nIV-VI show fragments of gastric-type mucosa with extensive intestinal metaplasia. Both in the glandular and foveolar layers, there is a somewhat pronounced aspect with diffuse mild nuclear enlargement, varying chromasia, and pseudostratification along the surface. Focally, there is some activity and scattered transition of a robust myo-epithelium. \nThis is a difficult-to-interpret picture, with differential diagnosis considering low-grade dysplasia and reactive cell changes.\n\nconclusion: Esophageal biopsies show gastric-type mucosa and squamocolumnar junction with intestinal metaplasia. \nII shows reactive epithelial changes. \nIII, IV, and VI show pronounced reactive epithelial changes. \nV shows epithelial changes best classified as indefinite for dysplasia, with a preference for reactive.\n\nbarrett_label: IND",
        "generated_report": "microscopy: I: fragments of gastric cardia-type mucosa with intestinal metaplasia and mild to moderate chronic inflammation. Locally, there is a circumscribed cluster of glandular structures with enlarged and hyperchromatic nuclei. II and III show columnar mucosa with intestinal metaplasia and low-grade dysplasia.\n\nbarrett_label: LGD",
        "report_extracted_label": "ND"
    },
    {
        "case_id": "RL-1000",
        "original_report": "microscopy: I: Fragments of squamocolumnar junction with gastric-type mucosa and intestinal metaplasia. In one biopsy, there is a circumscribed focus with enlarged and hyperchromatic nuclei. II and III show squamocolumnar junction with intestinal metaplasia and reactive changes. The case was reviewed in the context of the national advisory body for esophageal neoplasia (LANS case 1000) with the conclusion that I shows low-grade dysplasia and III shows a picture best classified as low-grade dysplasia based on uncertain p53 expression.\n\nconclusion: Esophageal biopsies show squamocolumnar junction with intestinal metaplasia. I shows low-grade dysplasia. II and III show a picture best classified as low-grade dysplasia based on (uncertain) p53 expression.\n\nbarrett_label: LGD",
        "generated_report": "microscopy: I: Fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. In one biopsy, there is a small cluster of glandular structures with an abnormal aspect with stacking of elongated and hyperchromatic nuclei. In some places, there is a small cluster of glandular structures in the glandular layer. Here, there is a small cluster of glandular structures in the glandular layer. Here, there is a small cluster of glandular structures with an abnormal aspect with more closely packed glandular structures and elongation and some stacking of elongated and hyperchromatic nuclei. In some places, there is a small cluster of glandular structures with an abnormal aspect with stacking of elongated and hyperchromatic nuclei. In some places, there is a small cluster of glandular structures in the glandular layer. Here, there is a small cluster of glandular structures with an abnormal aspect with stacking of elongated and hyperchromatic nuclei. In some places, there is a small cluster of glandular structures with an abnormal aspect with more closely packed glandular structures and elongation and some stacking of hyperchromatic and slightly enlarged nuclear appearance. There seems to be a subtle, abrupt morphological image. \nII: Columnar mucosa with intestinal metaplasia and reactive epithelial changes. \nII: Fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: Fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. No dysplasia is identified.\n\nbarrett_label: LGD",
        "report_extracted_label": "LGD"
    },
    {
        "case_id": "RL-1001",
        "original_report": "microscopy: I shows fragments of mucosa largely consisting of gastric cardia-type mucosa with intestinal metaplasia and locally of squamous type. One of the biopsies shows an abnormal aspect in which a large part shows an abrupt abnormal epithelial lining. This includes atypia and hyperchromasia. There is a varying degree of stratification and decrease of mucinous differentiation. \nII shows fragments of gastric cardia-type mucosa with intestinal metaplasia. In III, a single fragment without dysplasia.\n\nconclusion: I esophageal biopsies: squamocolumnar junction with intestinal metaplasia and low-grade dysplasia of columnar type epithelium. II and III esophageal biopsies: gastric-type mucosa with intestinal metaplasia and reactive epithelial changes, no dysplasia.\n\nbarrett_label: LGD",
        "generated_report": "microscopy: I: Fragments at the site of the squamocolumnar junction with limited intestinal metaplasia and reactive epithelial changes.\n\nconclusion: I esophageal biopsies: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. In one of the biopsies, there is a single place is not well assessable. Locally, there is a single place the biopsies: columnar mucosa with intestinal metaplasia and mild chronic inflammation. II shows fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. In one biopsy, there is a small cluster of glandular structures in the glandular layer shows a reactive cell picture.\n\nconclusion: I to IV esophageal biopsies: gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. III esophageal biopsies: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. III esophageal biopsies: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. III esophageal biopsies: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. III esophageal biopsies: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. III esophageal biopsies: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. III, there is a cluster of glandular structures in the glandular layer shows a reactive cell picture.\n\nconclusion: I to IV esophageal biopsies of columnar mucosa and squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. No dysplasia is identified.\n\nbarrett_label: LGD",
        "report_extracted_label": "LGD"
    },
    {
        "case_id": "RL-1002",
        "original_report": "microscopy: I shows fragments of gastric antrum-type mucosa with reactive epithelial changes, no intestinal metaplasia, no active inflammation, no Helicobacter pylori, and no dysplasia. \nII shows fragments of gastric cardia-type mucosa with a limited degree of intestinal metaplasia and moderate extensive chronic and focal active inflammation. There is a slight squamous epithelium component. Extensive reactive epithelial stromal changes are present. Locally, there is an abnormal focus with nuclear polymorphism, nuclear stratification, and loss of polarization. Differential diagnosis includes reactive atypia in inflammation and low-grade dysplasia. \nIII shows fragments of gastric cardia-type mucosa with focal extensive chronic and moderately extensive active inflammation. There are extensive reactive epithelial stromal changes. The nuclear image in III is less pronounced atypically compared to II.\n\nconclusion: I stomach biopsies: gastric antrum-type mucosa with reactive epithelial changes, no intestinal metaplasia, no dysplasia. \nII esophageal biopsies: squamocolumnar junction with intestinal metaplasia and low-grade dysplasia on a background of active inflammation. \nIII esophageal biopsies: gastric-type mucosa with intestinal metaplasia and moderate extensive chronic and active inflammation. There are difficult-to-interpret epithelial changes, preferably classified as indefinite for dysplasia.\n\nbarrett_label: LGD",
        "generated_report": "microscopy: I shows fragments of gastric cardia-type mucosa with intestinal metaplasia and a fragment of gastric cardia-type mucosa with microcystic changes, no intestinal metaplasia or dysplasia. \nII: fragments at the site of the squamocolumnar junction with intestinal metaplasia and reactive epithelial changes.\n\nconclusion: I and III esophageal biopsies: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes.\n\nconclusion: I and II esophageal biopsies: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes.\n\nconclusion: I and II esophageal biopsies: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes.\n\nconclusion: I and II esophageal biopsies: squamocolumnar junction with intestinal metaplasia and low-grade dysplasia.\n\nbarrett_label: LGD",
        "report_extracted_label": "LGD"
    },
    {
        "case_id": "RL-1003",
        "original_report": "microscopy: Fragmented mucosa and necrotic debris are present. The vital tissue is tangentially affected and suboptimally assessable. The epithelial component shows a complex cribriform arrangement and nuclear features with lost polarity. The picture is consistent with at least high-grade dysplasia, suspicious for (intramucosal) adenocarcinoma, with the possibility of invasive growth not demonstrable or to be excluded.\n\nconclusion: Esophageal/gastric cardia biopsies show at least high-grade dysplasia of gastric-type mucosa. The picture is suspicious for (intramucosal) adenocarcinoma, with the possibility of invasive growth not demonstrable or to be excluded.\n\nbarrett_label: HGD",
        "generated_report": "microscopy: I: Fragments of columnar-type mucosa with intestinal metaplasia and a fairly extensive abnormal arrangement and possibly cribriform patterns. The epithelium shows surface stratification of elongated and stratified nuclear features. The nuclear-cytoplasmic ratio, there is a corresponding image in the amount of inflammation. II: fragments at the site of the squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. II and II biopsies: columnar mucosa with intestinal metaplasia and reactive epithelial changes. II and II biopsies: columnar mucosa with intestinal metaplasia and reactive epithelial changes. II and II biopsies: columnar mucosa with intestinal metaplasia and reactive epithelial changes. II and II biopsies: columnar mucosa with intestinal metaplasia and reactive epithelial changes. II and II biopsies: columnar mucosa with intestinal metaplasia and reactive epithelial changes. II and II biopsies: columnar mucosa with intestinal metaplasia and reactive epithelial changes. II and II biopsies with extensive chronic and active inflammation and reactive epithelial changes. No indications for dysplasia.\n\nbarrett_label: HGD",
        "report_extracted_label": "HGD"
    },
    {
        "case_id": "RL-1004",
        "original_report": "microscopy: I shows a fragment of necrotic tissue and one biopsy at the level of the squamocolumnar junction. There is reactive squamous epithelium and a neoplastic glandular epithelial component tangentially affected. The architecture is complex, with moderate cytonuclear polymorphism and microcystic dilatation with intraluminal necrotic debris. II shows a partly similar and partly more pronounced picture.\n\nconclusion: I and II esophageal biopsies distal: squamocolumnar junction with intestinal metaplasia and at least high-grade dysplasia of columnar mucosa.\n\nbarrett_label: HGD",
        "generated_report": "microscopy: There are mucosal fragments partly lined with squamous and partly with gastric cardia-type mucosa with intestinal metaplasia and partly with reactive changes.\n\nconclusion: Esophageal biopsies show squamocolumnar junction with intestinal metaplasia and reactive epithelial changes.\n\nconclusion: Esophageal biopsies show squamocolumnar junction with intestinal metaplasia and reactive epithelial changes.\n\nconclusion: Esophageal biopsies show squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. In one biopsy, there is a preference for low-grade dysplasia.\n\nbarrett_label: LGD",
        "report_extracted_label": "HGD"
    },
    {
        "case_id": "RL-1005",
        "original_report": "microscopy: There are fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial and stromal changes. At the edge of one of the biopsies, there is a crushed glandular focus with some nuclear enlargement. Differential diagnosis considers a reactive picture with tangential sectioning and artifacts versus neoplasia.\n\nconclusion: Esophageal biopsies show gastric cardia-type mucosa with intestinal metaplasia and focal epithelial changes, classified as low-grade dysplasia.\n\nbarrett_label: LGD",
        "generated_report": "microscopy: I: Fragments of gastric-type mucosa with intestinal metaplasia and mild chronic inflammation. In one biopsy, there is a microscopically more disturbed. In one biopsy, there is a microscopically more disturbed. In one biopsy, there is a microscopically circumscribed cluster of glandular structures is seen, where the lining epithelium shows a slightly enlarged and hyperchromatic nuclei. II and III, IV esophageal biopsies: columnar-type mucosa with intestinal metaplasia and reactive epithelial changes.\n\nconclusion: I and II esophageal biopsies: columnar-type mucosa with intestinal metaplasia and reactive epithelial changes.\n\nconclusion: I and II esophageal biopsies: columnar-type mucosa with intestinal metaplasia and reactive epithelial changes.\n\nconclusion: I and II esophageal biopsies: columnar-type mucosa with intestinal metaplasia and reactive epithelial changes.\n\nbarrett_label: LGD",
        "report_extracted_label": "LGD"
    },
    {
        "case_id": "RL-1006",
        "original_report": "microscopy: I shows fragments of gastric cardia-type mucosa, no dysplasia, no intestinal metaplasia. No active inflammation. II shows multiple fragments of gastric-type mucosa with limited intestinal metaplasia. There is an extensive aberrant epithelial component with enlarged, round-oval nuclear image and loss of polarity. Very closely packed glandular structures with abnormal shape and diameter, microcystic luminal widening, and intraluminal necrotic debris. III shows mucosal fragments largely consisting of gastric-type mucosa with intestinal metaplasia and partly with squamous epithelium. IV shows fragmented mucosa partly consisting of squamous epithelium and partly of gastric-type mucosa with limited intestinal metaplasia. Focally, there is an abrupt morphologically abnormal aspect at the surface with stacking of a hyperchromatic nuclear image.\n\nconclusion: I gastric biopsies: gastric corpus mucosa with reactive epithelial changes, no intestinal metaplasia, no dysplasia, no active inflammation, no Helicobacter pylori. II esophageal biopsies: gastric-type mucosa with intestinal metaplasia and difficult-to-interpret atypia, preferably classified as high-grade dysplasia of columnar-type epithelium. III esophageal biopsies: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. IV esophageal biopsy: squamocolumnar junction with intestinal metaplasia and focal low-grade dysplasia of columnar-type epithelium.\n\nbarrett_label: HGD",
        "generated_report": "microscopy: I: Fragments entirely consist of a proliferation of atypical, tube-growing epithelial cells, partly with goblet cells. There is a cribriform arrangement in glandular structures and lining and closely packed and variably sized and shaped glandular structures. The lining epithelium shows alternating elongated and stratified nuclear appearance. There is a cribriform arrangement in glandular structures and lining and closely packed and variably sized and shaped glandular structures. The lining epithelium shows alternating elongated and hyperchromatic nuclei. There is a preference for low-grade dysplasia.\n\nconclusion: I and IV esophageal biopsies: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. II and III biopsies: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and a few crypts with intact maturation.\n\nconclusion: I and III esophageal biopsies: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. \nII: Columnar mucosa with intestinal metaplasia and reactive epithelial changes. \nII: Columnar mucosa with intestinal metaplasia and reactive epithelial changes. \nII: Columnar mucosa with intestinal metaplasia and reactive epithelial changes. \nII: Columnar mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and a few crypts with intact maturation.\n\nconclusion: I and II esophageal biopsies: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and a few crypts with variation in shape and diameter of the nuclear pattern. Architect",
        "report_extracted_label": "HGD"
    },
    {
        "case_id": "RL-1007",
        "original_report": "microscopy: I and II esophageal biopsies show columnar mucosa with limited intestinal metaplasia and presence of low-grade and high-grade dysplasia. III, IV, and V esophageal biopsies show squamocolumnar junction with intestinal metaplasia and low-grade dysplasia.\n\nconclusion: I through V esophageal biopsies show columnar mucosa with limited intestinal metaplasia and squamocolumnar junction with intestinal metaplasia. I and II biopsies show low-grade dysplasia with localized suspicion of high-grade dysplasia. III, IV, and V biopsies show low-grade dysplasia.\n\nbarrett_label: HGD",
        "generated_report": "microscopy: I: Fragments of gastric-type mucosa with intestinal metaplasia and a fairly extensive abnormal arrangement and possibly dystrophic goblet cells. There is a striking aspect of the foveolar layer. A few glands show stacked and elongated nuclear appearance. The findings are consistent with low-grade dysplasia.\n\nbarrett_label: LGD",
        "report_extracted_label": "HGD"
    },
    {
        "case_id": "RL-1008",
        "original_report": "microscopy: I shows fragmented fragments of gastric cardia and corpus-type mucosa with focal intestinal metaplasia and reactive epithelial changes. II shows fragments of gastric cardia-type mucosa with varying degrees of intestinal metaplasia, mild chronic focal active inflammation, and reactive epithelial changes. In one biopsy, there is an abrupt, distinct morphological picture with closely packed glandular structures showing variation in shape and complexity. The lining epithelium shows enlarged, hyperchromatic nuclei with varying degrees of stratification, variation in nuclear size, and loss of polarity. Differential diagnosis considers low-grade and high-grade dysplasia, with a preference for high-grade dysplasia. III shows superficial fragments of gastric cardia-type mucosa with intestinal metaplasia and focal low-grade dysplasia. IV shows superficial fragments of gastric cardia-type mucosa with intestinal metaplasia. V shows fragments of gastric cardia-type mucosa partly lined with squamous epithelium and an extensive abnormal epithelial component similar to that seen in II.\n\nconclusion: I and IV esophageal biopsies: gastric-type mucosa with intestinal metaplasia and reactive epithelial changes. II and V esophageal biopsies: gastric-type mucosa with squamocolumnar junction with intestinal metaplasia and high-grade dysplasia of columnar mucosa. III esophageal biopsies: gastric-type mucosa with squamocolumnar junction with intestinal metaplasia and low-grade dysplasia of columnar mucosa.\n\nbarrett_label: HGD",
        "generated_report": "microscopy: I: Fragments of gastric-type mucosa with intestinal metaplasia and a circumscript clusters of glandular structures of variable shape and diameter. The lining epithelium shows elongated and stratified nuclear pattern with closely packed glandular structures and lining and closely packed and variably sized and shaped glandular structures. The lining epithelium shows elongated and stratified nuclear pattern with stacking of elongated and hyperchromatic nuclei. There is a striking aspect of the nuclear pattern. The polarity is sometimes lost, with a preference for high-grade dysplasia.\n\nconclusion: I and IV esophageal biopsies: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. II and III biopsies: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: Squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. \nII: Squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. \nII: Squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. \nII: Squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. \nII: Squamocolumnar junction with intestinal metaplasia and a picture consistent with (at least) high-grade dysplasia of columnar-type epithelium. III esophageal biopsies: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and a few crypts with variation in shape and diameter, stratified nuclear",
        "report_extracted_label": "HGD"
    },
    {
        "case_id": "RL-1009",
        "original_report": "microscopy: There are partially fragmented mucosal fragments, mostly consisting of gastric-type mucosa with intestinal metaplasia and moderately extensive chronic active inflammation. Focally, squamous mucosa is also present. In one of the biopsies, there is a focus of glands with an abnormal appearance, showing increased nuclear size with some hyperchromasia.\n\nconclusion: Esophageal biopsies show squamocolumnar junction with intestinal metaplasia, mild chronic and active inflammation, and focal low-grade dysplasia of columnar mucosa.\n\nbarrett_label: LGD",
        "generated_report": "microscopy: I shows fragments of gastric cardia-type mucosa with intestinal metaplasia and a portion of the epithelium with stacking of elongated and hyperchromatic nuclei. There is a preference for high-grade dysplasia.\n\nconclusion: I and III esophageal biopsies: columnar mucosa with intestinal metaplasia and reactive epithelial changes. In one of the biopsies, there is a preference for high-grade dysplasia.\n\nconclusion: I and VIII esophageal biopsies show columnar mucosa with intestinal metaplasia and reactive epithelial changes. In one of the biopsies, there is a preference for high-grade dysplasia.\n\nbarrett_label: LGD",
        "report_extracted_label": "LGD"
    },
    {
        "case_id": "RL-1010",
        "original_report": "microscopy: There are fragments of mucosa very focally lined with squamous epithelium, largely consisting of gastric-type mucosa with extensive intestinal metaplasia. There is mild to moderate chronic and active inflammation. In one of the biopsies, partly crushed, densely packed glandular structures are seen, the lining epithelium of which shows a somewhat enlarged, irregularly placed nuclear pattern. There appears to be an abrupt transition to pre-existing and intestinal metaplastic mucosa. Differential diagnosis considers a reactive cell picture and (low-grade) dysplasia. Locally, there is also increased cytonuclear polymorphism.\n\nconclusion: Esophageal biopsies show squamocolumnar junction with intestinal metaplasia and low-grade dysplasia of columnar epithelium.\n\nbarrett_label: LGD",
        "generated_report": "microscopy: I: fragments of gastric cardia-type mucosa with intestinal metaplasia and a neoplastic epithelial component. The epithelium shows enlarged and rounded nuclei, variation in shape and size. The lining epithelium shows enlarged and rounded nuclei, variation in shape and size. The lining epithelium shows enlarged and rounded nuclei, variation in shape and size. The lining epithelium shows enlarged and rounded nuclei, variation in shape and size. The lining epithelium shows enlarged and rounded nuclei, variation in shape and size. The lining epithelium shows enlarged and rounded nuclei, variation in shape and size. The lining epithelium shows enlarged and rounded nuclei, variation in shape and size. The part of the epithelium shows a slightly abnormal aspect with stacking of elongated and hyperchromatic nuclei. There is a pronounced aspect of the nuclear pattern. Epithelium is seen with intestinal metaplasia and a clearly disturbed nuclear-cytoplasmic ratios. In deeper sections of I and cytonuclear polymorphism. In deeper sections of I, there is a preference for a reactive cell picture and low-grade dysplasia.\n\nconclusion: I and II esophageal biopsies and intestinal metaplasia. There is a preference for a reactive cell picture and low-grade dysplasia.\n\nconclusion: I and II esophageal biopsies show columnar mucosa with intestinal metaplasia and reactive epithelial changes. IV esophageal biopsies: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. IV esophageal biopsies: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. No intestinal metaplasia or dysplasia. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. No intestinal metaplasia or dysplasia. \nVII and III: fragments of",
        "report_extracted_label": "LGD"
    },
    {
        "case_id": "RL-1011",
        "original_report": "microscopy: In I and II, there is a similar picture of multiple mucosal fragments, partly lined with squamous and largely gastric-type mucosa with a varying degree of intestinal metaplasia. The columnar epithelium shows partly abnormal aspect with a still ratio, hyperchromasia, and stacking of the nuclear image. The image is consistent with low-grade dysplasia. In the deeper sections of I, there is, in jump 2, a focal microcystic dilated neoplastic gland with intraluminal necrotic debris, but insufficient indications for certain high-grade dysplasia.\n\nconclusion: I and II esophageal biopsies show squamocolumnar junction with low-grade dysplasia of columnar type mucosa in both submissions. Intestinal metaplasia is present in the background.\n\nbarrett_label: LGD",
        "generated_report": "microscopy: There are mucosal fragments partly lined with squamous and largely with gastric cardia-type mucosa with intestinal metaplasia. A portion of the epithelium shows a slightly enlarged nuclear appearance with some stratification. A few places show increased architectural and cytonuclear atypia.\n\nconclusion: Esophageal biopsies show squamocolumnar junction with intestinal metaplasia and low-grade dysplasia.\n\nbarrett_label: LGD",
        "report_extracted_label": "LGD"
    },
    {
        "case_id": "RL-1012",
        "original_report": "microscopy: I: Small fragments of gastric-type mucosa with intestinal metaplasia. In one of the biopsies, there is active inflammation and reactive changes. Nuclear stratification with hyperchromasia, variability in nuclear shape, and disturbed polarization are noted. Locally, there is a difficult-to-orient abnormal gland. II shows a partially similar picture. In deeper sections, the abnormalities appear more pronounced.\n\nconclusion: I esophageal biopsies distal: gastric-type mucosa with intestinal metaplasia and at least low-grade dysplasia of columnar epithelium. Locally, a high-grade lesion cannot be entirely ruled out. II esophageal biopsies distal: gastric-type mucosa with intestinal metaplasia and difficult-to-assess abnormality in the presence of active inflammation, best classified as low-grade dysplasia.\n\nbarrett_label: LGD",
        "generated_report": "microscopy: I: fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. In II, a similar picture, where either all biopsies contain neoplastic epithelium or everything can be interpreted as reactive in the context of panel evaluation (LANS 110), with low-grade dysplasia. The relationship with the underlying stroma. Differential diagnosis considers low-grade dysplasia and tangential sectioning, stratified nuclear pattern, and stratification. In the glandular layer, there is a corresponding picture is a more complex architecture with a pronounced fil architectural and nuclear polymorphism. The differential diagnosis considers low-grade dysplasia and tangential sectioning, stratified nuclear pattern, and stratification. In the glandular layer, there is a corresponding picture is a more complex architecture with a pronounced aspect of the foveolar layer. The lining epithelium shows elongated and hyperchromatic nuclei. Differential diagnosis considers low-grade dysplasia and tangential sectioning and a pseudo-stratified nuclear pattern. Differential diagnosis considers low-grade dysplasia and tangential sectioning, stratified nuclear pattern, and stratification. In the glandular layer, there is a corresponding picture is a more complex architecture with a pronounced aspect of the foveolar layer. Here, there is a corresponding picture is a more complex architecture with a pronounced aspect of the foveolar layer. Here, there is a corresponding picture is a more complex architecture with a pronounced aspect of the foveolar layer. The lining epithelium shows elongated and hyperchromatic nuclei, variation in shape and diameter of the nuclear pattern. In some areas, there is a corresponding picture is a more complex architecture with a pronounced aspect of the foveolar layer. The lining epithelium shows elongated and hyperchromatic nuclei is seen. In II, a similar picture is seen",
        "report_extracted_label": "HGD"
    },
    {
        "case_id": "RL-1013",
        "original_report": "microscopy: I shows gastric corpus-type mucosa without abnormalities. II consists of mucosal fragments partly lined with squamous epithelium and partly with gastric cardia-type mucosa with intestinal metaplasia. A portion of the columnar mucosa shows an abnormal aspect with enlarged, hyperchromatic nuclei, varying polarity, and sometimes increased cytonuclear polymorphism. There is active (intra-epithelial) inflammation. In III, a similar picture is seen, with less active inflammation.\n\nconclusion: I esophageal biopsies: gastric corpus-type mucosa without abnormalities. II and III esophageal biopsies: squamocolumnar junction with chronic active inflammation, intestinal metaplasia, and low-grade dysplasia of columnar type epithelium.\n\nbarrett_label: LGD",
        "generated_report": "microscopy: I: Fragments at the site of the squamocolumnar junction with limited intestinal metaplasia and reactive epithelial changes. In one of the biopsies, there is a cluster of glandular structures with an abrupt different appearance of the lining epithelium shows an enlarged and hyperchromatic nuclear appearance. Locally, there is a cluster of glandular structures with an abnormal aspect where the glandular layer. The glandular structures are seen, where the glandular layer. In one of the biopsies, there is a cluster of glandular structures with an abrupt different appearance. The material was reviewed in the context of the national advisory body for esophageal neoplasia (LANS case 700) with the conclusion: Esophageal biopsies show squamocolumnar junction with intestinal metaplasia and focal low-grade dysplasia of columnar-type epithelium.\n\nbarrett_label: LGD",
        "report_extracted_label": "LGD"
    },
    {
        "case_id": "RL-1014",
        "original_report": "microscopy: There are mucosal fragments partly lined with squamous epithelium and partly with gastric-type mucosa with intestinal metaplasia. A portion of the epithelium is tangentially cut, and there is mild chronic inflammation with minimal activity. In one of the biopsies, at the edge, there is an epithelial focus with a minimally deviant aspect.\n\nconclusion: Esophageal biopsies show squamocolumnar junction with intestinal metaplasia and epithelial changes of columnar mucosa, best classified as indefinite for dysplasia. Given the medical history, there is a preference for low-grade dysplasia.\n\nbarrett_label: IND",
        "generated_report": "microscopy: I: fragments of mucosa partly consisting of gastric cardia-type mucosa with intestinal metaplasia and a fragment of squamous epithelium. In one of the biopsies, there is a preference for a reactive cell picture.\n\nconclusion: I esophageal biopsies: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: Esophageal biopsies show squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. \nII: Esophageal biopsies show squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. \nII: Esophageal biopsies show squamocolumnar junction with intestinal metaplasia and (at least) low-grade dysplasia.\n\nbarrett_label: HGD",
        "report_extracted_label": "LGD"
    },
    {
        "case_id": "RL-1015",
        "original_report": "microscopy: Fragmented mucosal biopsies show an abnormal appearance, partly consisting of ulcer debris. The mucosa includes gastric cardia-type mucosa with a pronounced, sometimes villous appearance of the foveolar layer. The lining epithelium shows hyperchromasia and elongation, sometimes with some stratification. At a few locations, there is a slightly more complex glandular configuration, where both low-grade and focal high-grade dysplasia are considered. No convincing p53 overexpression is seen.\n\nconclusion: Esophageal biopsies show gastric-type mucosa with low-grade dysplasia, in the background there is mild chronic and active inflammation and loose ulcer base debris.\n\nbarrett_label: LGD",
        "generated_report": "microscopy: I: fragmented mucosal fragments lined with columnar-type epithelium, gastric cardia-type mucosa shows a difficult-to-interpret image. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and a small nucleolus. A single fragment of gastric cardia-type mucosa with intestinal metaplasia and a small nucleolus. A single fragment of gastric cardia-type mucosa with intestinal metaplasia and a small nucleolus. A single focus in the glandular layer shows overexpression of p53 in some areas. Differential diagnosis considers low-grade and high-grade dysplasia.\n\nconclusion: I and IV esophageal biopsies: columnar mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and a small nucleolus. No clear extension of the glandular layer shows overexpression of p53 overexpression. II shows fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: Squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. \nII: Squamocolumnar junction with intestinal metaplasia and reactive epithelial changes.\n\nbarrett_label: HGD",
        "report_extracted_label": "LGD"
    },
    {
        "case_id": "RL-1016",
        "original_report": "microscopy: In I to IX, there is a corresponding image of fragments of gastric cardia-type mucosa with extensive intestinal metaplasia. There is an abnormal aspect with a pronounced partly papillomatous appearance of the foveolar layer. In the lamina propria, there is active stroma with congested blood vessels in the tips of the villi, sometimes with extravasation. In addition to stromal changes, there are epithelial changes, including stratification, elongated and partly hyperchromatic nuclei, and an extensive four-layered aspect of the superficial epithelial layer. In multiple biopsies, there is a yellow aspect of the epithelial changes. Differential diagnosis considers pronounced reactive changes, tangential sectioning, and indefinite for dysplasia. No abnormal staining is seen in p53 immunohistochemistry. The material from VI to IX was reviewed in the context of panel assessment.\n\nconclusion: I to IX esophageal biopsies show intestinal metaplasia with epithelial and stromal changes consistent with regeneration and inflammation. VI shows epithelial changes best classified as indefinite for dysplasia. I-V and VII-IX show insufficient indications for certain dysplasia.\n\nbarrett_label: IND",
        "generated_report": "microscopy: I shows fragments of gastric cardia-type mucosa with intestinal metaplasia and a neoplastic epithelial component. The differential diagnosis considers low-grade and high-grade dysplasia.\n\nbarrett_label: HGD",
        "report_extracted_label": "ND"
    },
    {
        "case_id": "RL-1017",
        "original_report": "microscopy: I biopsies of gastric corpus and antrum-type mucosa with focal intestinal metaplasia of the gastric cardia-type mucosa. No dysplasia. In II, fragmented esophageal mucosa fragments, partly consisting of squamous epithelium and partly lined with gastric cardia-type mucosa. There is moderately extensive chronic and slight active inflammation, and reactive epithelial stromal changes. A part of the epithelium with intra-epithelial active inflammation shows an increased degree of atypia. Scattered multinucleation and frosting on epithelium.\n\nconclusion: Gastric and esophageal biopsies: I biopsies of gastric antrum and corpus-type mucosa show intestinal metaplasia and slight chronic inflammation. No activity, no Helicobacter pylori, no dysplasia. II esophageal biopsies show squamocolumnar junction with moderately extensive chronic, slight active inflammation, and reactive epithelial changes, no dysplasia. There is focal intestinal metaplasia.\n\nbarrett_label: ND",
        "generated_report": "microscopy: There are mucosal fragments partly lined with squamous and largely of gastric cardia-type mucosa with intestinal metaplasia and partly with squamous epithelium. In one of the biopsies, there is a slightly enlarged and hyperchromatic nuclei. In one of the biopsies, there is a slightly enlarged and hyperchromatic nuclei. In one of the biopsies, there is a slightly enlarged and hyperchromatic nuclei. In one of the biopsies, there is a slightly enlarged and hyperchromatic nuclei. In one of the biopsies, there is a slightly enlarged and hyperchromatic nuclei. In one of the biopsies, there is a slightly enlarged and hyperchromatic nuclei. In one of the biopsies, there is a slightly enlarged and hyperchromatic nuclei. There is a preference for a reactive cell picture.\n\nconclusion: Esophageal biopsies show columnar mucosa with intestinal metaplasia and reactive epithelial changes.\n\nbarrett_label: LGD",
        "report_extracted_label": "ND"
    },
    {
        "case_id": "RL-1018",
        "original_report": "microscopy: There are fragments of gastric-type mucosa with extensive intestinal metaplasia. In the lamina propria, a round-cell infiltrate is present with reactive epithelial and stromal changes. Locally, in one of the biopsies, there is a focus of glands with an abnormal nuclear appearance, slightly enlarged, slightly irregularly bounded with some hyperchromasia. In deeper sections, this focus is no longer present.\n\nconclusion: Esophageal biopsies show gastric-type mucosa with intestinal metaplasia and locally low-grade dysplasia.\n\nbarrett_label: LGD",
        "generated_report": "microscopy: I shows fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. Locally, there is a preference for high-grade dysplasia.\n\nconclusion: I and IV esophageal biopsies: columnar mucosa with intestinal metaplasia and reactive epithelial changes. II shows fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. Locally, there is a preference for high-grade dysplasia.\n\nconclusion: I and IV esophageal biopsies: columnar mucosa with intestinal metaplasia and reactive epithelial changes. II shows fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. Locally, there is a preference for high-grade dysplasia.\n\nconclusion: I and IV esophageal biopsies: columnar mucosa with intestinal metaplasia and reactive epithelial changes. IV esophageal biopsies: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. IV esophageal biopsies: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. IV esophageal biopsies: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. IV esophageal biopsies: gastric cardia-type mucosa with intestinal metaplasia and mild inflammation. IV and VIII esophageal biopsies show columnar mucosa with intestinal metaplasia and low-grade dysplasia.\n\nbarrett_label: LGD",
        "report_extracted_label": "LGD"
    },
    {
        "case_id": "RL-1019",
        "original_report": "microscopy: A fragment of gastric-type mucosa with intestinal metaplasia shows an abnormal aspect with fibrosing of the lamina propria, locally increased cellularity consisting of lymphocytes, plasma cells, and focal neutrophilic granulocytes. There is some activity, and a number of glandular structures show architectural complexity with basal pigmentation and branching. Differential diagnosis considers regeneration and low-grade dysplasia.\n\nconclusion: Esophageal biopsies show gastric-type mucosa with intestinal metaplasia and epithelial changes indefinite for dysplasia, with a preference for a reactive picture in the context of a healed ulcer.\n\nbarrett_label: IND",
        "generated_report": "microscopy: I: Fragments of columnar-type mucosa with intestinal metaplasia. The material is partly tangentially affected and shows and partly extensive intestinal metaplasia. The lining epithelium shows elongated and hyperchromatic nuclei. There is a striking epithelial component, including abnormal epithelium. A part of the nuclear pattern becomes strongly polymorphic, and variable in shape and diameter. The lining epithelium shows elongated and hyperchromatic nuclei. There is a striking epithelial component, including abnormal epithelium. A part of the foveolar layer shows overexpression of p53, a preference for high-grade dysplasia.\n\nconclusion: I esophageal biopsies: columnar mucosa with intestinal metaplasia and reactive epithelial changes. II and II biopsies: columnar mucosa with intestinal metaplasia and reactive epithelial changes. II and II biopsies: columnar mucosa with intestinal metaplasia and reactive epithelial changes. II and II biopsies show columnar mucosa with intestinal metaplasia and high-grade dysplasia. \nII: Columnar mucosa with intestinal metaplasia and reactive epithelial changes. II and II biopsies are classified as low-grade dysplasia. \nII: Columnar mucosa with intestinal metaplasia and reactive epithelial changes. II and II biopsies with intestinal metaplasia. In II, a squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. No intestinal metaplasia, no active inflammation, no dysplasia.\n\nbarrett_label: HGD",
        "report_extracted_label": "ND"
    },
    {
        "case_id": "RL-1020",
        "original_report": "microscopy: I: mucosal fragments partly lined with squamous and partly with gastric-type mucosa with intestinal metaplasia. There is mild to moderately extensive chronic inflammation and reactive epithelial stromal changes. In addition, there are areas with stacking of elongated nuclear images, preferably interpreted as foveolar low-grade dysplasia. II: a single fragment of transition from gastric corpus-type mucosa to squamous epithelium with mild chronic and active inflammation.\n\nconclusion: I and II biopsies from the distal esophagus show gastric-type mucosa with intestinal metaplasia and reactive epithelial changes. I contains low-grade dysplasia.\n\nbarrett_label: LGD",
        "generated_report": "microscopy: There are mucosal fragments partly lined with squamous and partly with gastric cardia-type mucosa with intestinal metaplasia. A portion of the epithelium shows a slightly enlarged nuclear appearance with some stratification. A few places show a somewhat pronounced and hyperchromatic nuclei. The abnormal aspect with the inflammation, there is a cluster of glandular structures with an abruptly different appearance. There is a background of mild chronic inflammation. Part of the epithelium shows an abnormal aspect with closely packed glandular structures and slightly enlarged and hyperchromatic nuclei. In the lamina propria, there is a small cluster of glandular structures with an abnormal aspect with more closely packed and show stacking of elongated and hyperchromatic nuclei. The abnormalities are largely limited to the glandular layer. The epithelium shows an abnormal aspect with closely packed glandular structures and slightly enlarged and hyperchromatic nuclei. The abnormalities are largely limited to the glandular layer. The epithelium shows a slightly enlarged and hyperchromatic nuclei. The abnormalities are largely limited to the glandular layer. The epithelium shows a slightly enlarged and hyperchromatic nuclei. The abnormalities are largely limited to the glandular layer. The epithelium shows a slightly enlarged and hyperchromatic nuclei. The differential diagnosis considers low-grade dysplasia and reactive changes.\n\nbarrett_label: LGD",
        "report_extracted_label": "LGD"
    },
    {
        "case_id": "RL-1021",
        "original_report": "microscopy: I shows fragments of mucosa with an abnormal appearance, suggesting healed erosion. \nAddendum: The case was reviewed in the context of panel assessment (LANS/DEPP case 1021) with the conclusion: Esophageal biopsies show columnar mucosa with reactive epithelial changes.\n\nconclusion: Esophageal biopsies show gastric-type mucosa with mild chronic active inflammation and reactive epithelial changes.\n\nbarrett_label: ND",
        "generated_report": "microscopy: I: fragmented mucosal fragments lined with cylindrical epithelium and partly with cylindrical epithelium. The lining epithelium is partly shows intact architecture and maturation of the epithelium. Locally, there is a corresponding picture is seen. \nII: Fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. In one biopsy, there is a corresponding picture is seen. \nII: Fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. In one biopsy, there is a corresponding picture is seen. \nII: Fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nVII: Fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nVII: Fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nVII: Squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. \nVII: Squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. \nVII: Squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. \nVII: Squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. \nVII: Fragments of gastric cardia-type mucosa with intestinal metaplasia and a fairly extensive abnormal arrangement and maturation of the lining epithelium shows an abrupt transition to pre-existing patterns.\n\nconclusion: Esophageal biopsies show columnar mucosa with intestinal metaplasia and low-grade dysplasia.\n\nbarrett_label: LGD",
        "report_extracted_label": "ND"
    },
    {
        "case_id": "RL-1022",
        "original_report": "microscopy: In I and II, there is a squamocolumnar junction with intestinal metaplasia and a background of mild chronic inflammation. In I, several glandular clusters show lining epithelium with elongation and hyperchromatic nuclear features. In the step section of II, there is a more evident abnormal picture with enlargement, slight irregular arrangement, and nuclear features. Locally, intraepithelial active inflammation is also present. Given the cytonuclear and architectural atypia, II raises concern for both low-grade and high-grade dysplasia, though insufficient for a definitive diagnosis of high-grade dysplasia.\n\nconclusion: I and II esophageal biopsies show squamocolumnar junction with intestinal metaplasia and low-grade dysplasia of columnar epithelium.\n\nbarrett_label: LGD",
        "generated_report": "microscopy: I: Fragments of gastric cardia-type mucosa with intestinal metaplasia and a portion of the surface epithelial lining epithelium shows an enlarged and hyperchromatic nuclei. There is a background of mild chronic and active inflammation. A part of the epithelium shows an abnormal aspect with enlarged and hyperchromatic nuclei. There is a background of mild chronic and active inflammation. A part of the epithelium shows an abnormal aspect with enlarged and hyperchromatic nuclei. There is a background of mild chronic and active inflammation. Locally, there is a small and lacks a portion of the epithelium, particularly in the glandular layer. II shows fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: Squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. \nII: Squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. \nII: Squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. \nII: Squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nVI shows gastric cardia-type mucosa with intestinal metaplasia and low-grade dysplasia.\n\nconclusion: Esophageal biopsies show columnar mucosa with intestinal metaplasia and reactive epithelial changes. In one biopsy, there is a preference for high-grade abnormality",
        "report_extracted_label": "LGD"
    },
    {
        "case_id": "RL-1023",
        "original_report": "microscopy: I shows a squamocolumnar junction with, in two of the three biopsies, an abnormal aspect with an abrupt transition to epithelium with enlarged hyperchromatic nuclear appearance. No intestinal metaplasia. II shows a squamocolumnar junction with intestinal metaplasia and no dysplasia. III shows fragments of columnar mucosa with extensive intestinal metaplasia and sometimes pronounced epithelial changes against a background of mild chronic inflammation. No dysplasia.\n\nconclusion: I contains biopsies with squamocolumnar junction and low-grade dysplasia of columnar-type epithelium. II contains biopsies with squamocolumnar junction and intestinal metaplasia, no dysplasia. III contains biopsies with columnar mucosa, intestinal metaplasia, and reactive epithelial changes, no dysplasia.\n\nbarrett_label: LGD",
        "generated_report": "microscopy: I: fragmented mucosal fragments partly lined with squamous and largely with gastric cardia-type mucosa with intestinal metaplasia and a fragment of squamous epithelium. In one of the biopsies, there is a preference for high-grade dysplasia.\n\nconclusion: I and II esophageal biopsies: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. In one of the biopsies, there is a preference for high-grade dysplasia.\n\nconclusion: I and II esophageal biopsies: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. \nII shows fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII shows fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII shows fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII shows fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII shows fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII shows fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII shows fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII shows fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII shows fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII shows fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII shows fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. II shows fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. II",
        "report_extracted_label": "LGD"
    },
    {
        "case_id": "RL-1024",
        "original_report": "microscopy: I: Fragments of gastric corpus and cardia-type mucosa with focal intestinal metaplasia. \nII: Fragments of gastric cardia-type mucosa with varying degrees of intestinal metaplasia. In one biopsy, there is an abnormal aspect with somewhat disordered glandular structures. The lining epithelium shows hyperchromatic nuclei, some stratification, and disordered arrangement. A few intra-epithelial apoptotic figures are seen, and there is also active intra-epithelial inflammation. \nIII: Fragment at the squamocolumnar junction with intestinal metaplasia.\n\nconclusion: I esophageal biopsy: gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation, no dysplasia. \nII esophageal biopsy: gastric cardia-type mucosa with intestinal metaplasia, focal active inflammation, and epithelial changes, best classified as low-grade dysplasia. \nIII esophageal biopsy: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes, no dysplasia.\n\nbarrett_label: LGD",
        "generated_report": "microscopy: I: fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. In one biopsy, there is a preference for high-grade dysplasia.\n\nconclusion: I and IV esophageal biopsies: gastric-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and mild inflammation. In one biopsy, there is a preference for high-grade dysplasia.\n\nconclusion: I and IV esophageal biopsies: columnar mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and mild inflammation. In one biopsy, there is a preference for high-grade dysplasia.\n\nconclusion: I and IV esophageal biopsies: columnar mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and mild inflammation. In one biopsy, there is a preference for high-grade dysplasia.\n\nconclusion: I and IV esophageal biopsies: gastric-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and mild inflammation. In one biopsy, there is a preference for high-grade dysplasia.\n\nconclusion: I and IV esophageal biopsies: columnar mucosa with intestinal metaplasia and reactive epithelial changes. \nV: fragments of gastric cardia-type mucosa with intestinal metaplasia and mild inflammation. II: fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. II: fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. II: fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. II",
        "report_extracted_label": "LGD"
    },
    {
        "case_id": "RL-1025",
        "original_report": "microscopy: I, IV, and V show fragments of gastric cardia-type mucosa with multiple moderately intense cuts. There is a background of mild chronic and focal active inflammation with reactive stromal and epithelial changes. In II and III, there is also an epithelial focus with an abnormal aspect in one of the biopsies, showing a slightly enlarged and hyperchromatic nuclear appearance.\n\nconclusion: I, IV, and V esophageal biopsies: columnar mucosa with intestinal metaplasia and reactive epithelial changes. II esophageal biopsies: columnar mucosa with intestinal metaplasia and low-grade dysplasia. III esophageal biopsies: columnar mucosa with intestinal metaplasia and high-grade dysplasia.\n\nbarrett_label: HGD",
        "generated_report": "microscopy: I: Fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic and active inflammation and reactive epithelial changes. II and III, and IV, a small nucleolus. Differential diagnosis considers low-grade dysplasia and a reactive cell picture is suspicious for low-grade dysplasia.\n\nconclusion: I and IV esophageal biopsies: columnar mucosa with intestinal metaplasia and reactive epithelial changes. II and III, and IV, there is a preference for high-grade dysplasia.\n\nconclusion: I and IV esophageal biopsies: columnar mucosa with intestinal metaplasia and reactive epithelial changes, no dysplasia. \nII: Fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. Locally, there is a preference for a neoplastic component.\n\nconclusion: I and II esophageal biopsies: columnar mucosa with intestinal metaplasia and focal low-grade dysplasia.\n\nconclusion: I and II esophageal biopsies: columnar mucosa with intestinal metaplasia and focal low-grade dysplasia.\n\nbarrett_label: LGD",
        "report_extracted_label": "HGD"
    },
    {
        "case_id": "RL-1026",
        "original_report": "microscopy: I: Esophageal biopsies at 39 cm show gastric cardia-type mucosa with intestinal metaplasia and pronounced epithelial changes best classified as indefinite for dysplasia. \nII: Esophageal biopsies at 37 cm show squamocolumnar junction with intestinal metaplasia of gastric cardia-type mucosa with pronounced epithelial changes and best classified as indefinite for dysplasia, with a preference for a reactive cellular appearance.\n\nconclusion: I and II esophageal biopsies show gastric cardia-type mucosa and squamocolumnar junction with intestinal metaplasia and pronounced epithelial changes best classified as indefinite for dysplasia, with a preference for a reactive cellular appearance.\n\nbarrett_label: IND",
        "generated_report": "microscopy: I shows fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. Locally, there is a preference for a neoplastic component. II: fragments of gastric cardia-type mucosa with mild to moderately extensive chronic inflammation, minimal active inflammation, and reactive epithelial changes. One biopsy shows a more complex architecture and maturation. There is a pronounced aspect of the foveolar layer and some stacking and elongation of the nuclear image. The nuclear features epithelium without abnormalities. II: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. One biopsy shows a more complex architecture and maturation. There is a pronounced aspect of the foveolar layer and some stacking and elongation of the nuclear image. The nuclear features epithelium without abnormalities. II: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. IV shows fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. IV shows fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. IV shows fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. IV shows columnar mucosa with intestinal metaplasia and low-grade dysplasia.\n\nbarrett_label: LGD",
        "report_extracted_label": "ND"
    },
    {
        "case_id": "RL-1027",
        "original_report": "microscopy: I shows gastric-type mucosa without abnormalities, no intestinal metaplasia, no Helicobacter pylori, and no dysplasia. II shows mucosal fragments largely lined with gastric-type mucosa with extensive intestinal metaplasia and partly with squamous epithelium. In the lamina propria, there is a slight to moderate dense round cell infiltrate with focal activity. The columnar epithelium shows nuclear enlargement and hyperchromasia. The squamocolumnar junction with intestinal metaplasia shows epithelial changes difficult to classify, considered indefinite for dysplasia.\n\nconclusion: I: gastric biopsies show gastric-type mucosa without abnormalities. II: esophageal biopsies show squamocolumnar junction with intestinal metaplasia and epithelial changes classified as indefinite for dysplasia.\n\nbarrett_label: IND",
        "generated_report": "microscopy: I: Fragments of columnar epithelium, with formation epithelium showing enlarged and stratified nuclear pattern. The material was reviewed in the context of panel assessment (LANS), where morphological epithelial abnormalities are present. In the glandular layer, there is a more complex architecture with a pronounced villous aspect of the foveolar layer. The lining epithelium shows a prominent, partly villous arrangement of glandular structures and a disturbed nuclear-cytoplasmic ratio. The fragment is tangentially sectioned, and there is a more complex architecture with a pronounced villous aspect of the foveolar layer. The lining epithelium shows a prominent, partly villous arrangement of glandular structures and a disturbed nuclear-cytoplasmic ratio. The fragment is tangentially sectioned, and there is a more complex architecture with a pronounced villous aspect of the foveolar layer. The lining epithelium shows a prominent, partly villous arrangement of the foveolar layer and extensive reactive changes. II esophageal biopsies: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. II esophageal biopsies: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. II esophageal biopsies: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes.\n\nbarrett_label: HGD",
        "report_extracted_label": "IND"
    },
    {
        "case_id": "RL-1028",
        "original_report": "microscopy: I shows fragments of gastric cardia and corpus-type mucosa with limited intestinal metaplasia. \nII shows fragments of gastric cardia-type mucosa with intestinal metaplasia and a minimal focus of glandular structures with a slightly enlarged and hyperchromatic nuclear pattern. \nIII shows mucosal fragments mostly consisting of gastric cardia-type mucosa with intestinal metaplasia and locally squamous epithelium. \n\nAddendum: III esophageal biopsies show gastric cardia-type mucosa and the squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. II esophageal biopsy shows gastric-type mucosa with intestinal metaplasia and focal epithelial changes best classified as indefinite for dysplasia.\n\nconclusion: I and III esophageal biopsies: gastric cardia-type mucosa and the squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. \nII esophageal biopsy: gastric-type mucosa with intestinal metaplasia and focal epithelial changes, best classified as indefinite for dysplasia, with a preference for low-grade dysplasia.\n\nbarrett_label: IND",
        "generated_report": "microscopy: I: fragments of columnar mucosa with intestinal metaplasia and reactive stromal and epithelial changes. In one biopsy, there is a deviating image with a preference for low-grade dysplasia.\n\nconclusion: I esophageal biopsies: gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. In one biopsy, there is a deviating image with a preference for low-grade dysplasia.\n\nconclusion: I esophageal biopsies: gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. In one biopsy, there is a deviating image with a preference for low-grade dysplasia.\n\nconclusion: I esophageal biopsies: gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. In one biopsy, there is a deviating image with a preference for low-grade dysplasia.\n\nconclusion: I esophageal biopsies is under review in the glandular layer with clusters of glandular structures with a hyperchromatic and hyperchromatic nuclei. In deeper sections of I, there is a deviating image with a preference for low-grade dysplasia.\n\nconclusion: I esophageal biopsies: gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes, no dysplasia. \nII: Columnar mucosa with intestinal metaplasia and reactive epithelial changes, no dysplasia. \nII: fragments of columnar mucosa with intestinal metaplasia and reactive epithelial changes, no dysplasia. \nII: fragments of columnar mucosa with intestinal metaplasia and reactive stromal and epithelial changes. \nII: fragments of columnar mucosa with intestinal metaplasia and reactive epithelial changes, no dysplasia. \nII: fragments of columnar mucosa with intestinal metaplasia and reactive epithelial changes, no dysplasia. \nII: fragments of",
        "report_extracted_label": "LGD"
    },
    {
        "case_id": "RL-1029",
        "original_report": "microscopy: I to IV show fragments of gastric cardia-type mucosa with incidental intestinal metaplasia and an extensive abnormal epithelial aspect. There is chronic and active inflammation with a cellular lamina propria and varying degrees of activity. Part of the epithelial foveolar layer shows a piled-up arrangement of hyperchromatic nuclei. Scattered in the glandular layer, a few glands exhibit abnormal morphological features. In IV, a transition to squamous epithelium is observed, with a more pronounced image, including variation in the disturbed nuclear cytoplasmic ratio. In IV, both low-grade and high-grade dysplasia are considered.\n\nconclusion: I-III esophageal biopsies show gastric-type mucosa with minimal intestinal metaplasia and low-grade dysplasia of columnar epithelium in the setting of chronic active inflammation. IV biopsy shows squamocolumnar junction with both low-grade and high-grade dysplasia of columnar-type epithelium.\n\nbarrett_label: HGD",
        "generated_report": "microscopy: There are fragments of esophageal biopsy material, partly lined with squamous and largely with gastric cardia-type mucosa with intestinal metaplasia and a difficult-to-interpret epithelial changes in the presence of active inflammation. A part of the epithelium shows stratification of an elongated and stratified nuclear features. The nuclear features epithelium without abnormalities. II shows fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. One biopsy shows a clearly abnormal aspect with stacking and elongation of the nuclear image. A part of the epithelium shows stratification of an elongated and stratified nuclear features. Differential diagnosis considers low-grade and high-grade dysplasia.\n\nbarrett_label: LGD",
        "report_extracted_label": "HGD"
    },
    {
        "case_id": "RL-1030",
        "original_report": "microscopy: Fragmented mucosal biopsies partly consisting of squamous epithelium and partly of fibrinopurulent exudate, with minimal presence of fungus in the PAS-D. There is a fragment of glandular epithelium with an abnormal appearance. The fragment is tangentially sectioned and shows closely packed glandular structures with some variation in shape and diameter. There is no recognizable orientation or maturation. In the intervening stroma and also intra-epithelially, neutrophilic granulocytes are seen.\n\nconclusion: Esophageal biopsies at 35 cm show squamocolumnar junction with intestinal metaplasia, extensive active inflammation, and minimal presence of fungus. In addition, there are epithelial changes best classified as high-grade dysplasia of columnar mucosa.\n\nbarrett_label: HGD",
        "generated_report": "microscopy: There are mucosal fragments partly lined with squamous and largely with gastric cardia-type mucosa with intestinal metaplasia and a regular aspect. The lining epithelium shows elongated and stratified nuclear features. The maturation towards the surface is noted.\n\nconclusion: Esophageal biopsies show columnar mucosa with intestinal metaplasia and at least high-grade dysplasia, with a preference for high-grade dysplasia.\n\nbarrett_label: HGD",
        "report_extracted_label": "HGD"
    },
    {
        "case_id": "RL-1031",
        "original_report": "microscopy: Partly tangentially sectioned mucosal fragments of gastric type with varying degrees of intestinal metaplasia. There is a background of chronic and active inflammation, and there are architectural changes. The lining epithelium shows variable changes associated with active inflammation. Local epithelial changes are noted, and immunohistochemical p53 overexpression was reported, although no clear atypia or atypical proliferation is seen on H&E.\n\nconclusion: Esophageal biopsies show a squamocolumnar junction with intestinal metaplasia and chronic and active inflammation. Local epithelial changes are best classified as low-grade dysplasia.\n\nbarrett_label: LGD",
        "generated_report": "microscopy: There are mucosal fragments mostly consisting of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes.\n\nconclusion: Esophageal biopsies show squamocolumnar junction with intestinal metaplasia and reactive epithelial changes.\n\nconclusion: Esophageal biopsies show columnar mucosa with intestinal metaplasia and reactive epithelial changes.\n\nconclusion: Esophageal biopsies show columnar mucosa with intestinal metaplasia and reactive epithelial changes.\n\nconclusion: Esophageal biopsies show columnar mucosa with intestinal metaplasia and reactive epithelial changes.\n\nconclusion: Esophageal biopsies show columnar mucosa with intestinal metaplasia and reactive epithelial changes.\n\nconclusion: Esophageal biopsies show columnar mucosa with intestinal metaplasia and reactive epithelial changes.\n\nconclusion: Esophageal biopsies show columnar mucosa with intestinal metaplasia and reactive epithelial changes.\n\nconclusion: Esophageal biopsies show columnar mucosa with intestinal metaplasia and reactive epithelial changes.\n\nbarrett_label: LGD",
        "report_extracted_label": "LGD"
    },
    {
        "case_id": "RL-1032",
        "original_report": "microscopy: I and II show tangentially affected mucosal fragments at the squamocolumnar junction. There is intestinal metaplasia with mild chronic and active inflammation. In I, there is a focal glandular focus where the lining epithelium shows an abruptly morphologically abnormal and enlarged nuclear appearance. In II, a similar picture is observed, but more pronounced.\n\nconclusion: I and II esophageal biopsies show squamocolumnar junction with intestinal metaplasia and low-grade dysplasia.\n\nbarrett_label: LGD",
        "generated_report": "microscopy: I: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: Columnar mucosa with intestinal metaplasia and reactive epithelial changes. \nII: Columnar mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. No dysplasia. II esophageal biopsies: gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial",
        "report_extracted_label": "LGD"
    },
    {
        "case_id": "RL-1033",
        "original_report": "microscopy: Mucosal fragments mostly consist of gastric-type mucosa with extensive intestinal metaplasia, and focally lined with squamous epithelium. There is mild chronic and active inflammation.\n\nconclusion: Esophageal biopsies show squamocolumnar junction with intestinal metaplasia and reactive epithelial changes.\n\nbarrett_label: ND",
        "generated_report": "microscopy: I: fragmented mucosal fragments lined with gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. In one of the biopsies are reactive epithelial changes, the presence of goblet cells. There is a preference for low-grade dysplasia.\n\nconclusion: I and III esophageal biopsies: columnar mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: Columnar mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. No dysplasia is identified.\n\nbarrett_label: LGD",
        "report_extracted_label": "ND"
    },
    {
        "case_id": "RL-1034",
        "original_report": "microscopy: There are mucosal fragments at the level of the squamocolumnar junction with extensive intestinal metaplasia of gastric-type mucosa. There is at least moderately extensive chronic inflammation with nodular lymphoid aggregates and a mixture with neutrophilic granulocytes transgressing the epithelium. Reactive epithelial and stromal changes are present. The picture is, based on focal p53 overexpression, classified as indefinite for dysplasia with differential diagnosis of low-grade dysplasia.\n\nconclusion: Esophageal biopsies show squamocolumnar junction with intestinal metaplasia and chronic and active inflammation. Epithelial changes, based on focal p53 overexpression, are best classified as low-grade dysplasia.\n\nbarrett_label: LGD",
        "generated_report": "microscopy: There are mucosal fragments partly lined with squamous and largely of gastric cardia-type mucosa with intestinal metaplasia and partly of gastric cardia-type mucosa with intestinal metaplasia and partly of gastric cardia-type mucosa with intestinal metaplasia and partly of gastric cardia-type mucosa with intestinal metaplasia and partly of gastric cardia-type mucosa with intestinal metaplasia and partly of gastric cardia-type mucosa with intestinal metaplasia and partly of gastric cardia-type mucosa with intestinal metaplasia and partly of gastric cardia-type mucosa with intestinal metaplasia and partly of gastric cardia-type mucosa with intestinal metaplasia and partly of gastric cardia-type mucosa with intestinal metaplasia and partly of gastric cardia-type mucosa with intestinal metaplasia and partly of gastric cardia-type mucosa with intestinal metaplasia and partly of gastric cardia-type mucosa with intestinal metaplasia and partly of gastric cardia-type mucosa with intestinal metaplasia and partly of gastric cardia-type mucosa with intestinal metaplasia and partly of gastric cardia-type mucosa with intestinal metaplasia and partly of gastric cardia-type mucosa with intestinal metaplasia and partly of gastric cardia-type mucosa with intestinal metaplasia and focal squamous and II, there is a preference for a reactive cell picture.\n\n best classified as indefinite for dysplasia.\n\nbarrett_label: LGD",
        "report_extracted_label": "LGD"
    },
    {
        "case_id": "RL-1035",
        "original_report": "microscopy: I shows multiple fragmented biopsies at the level of the squamocolumnar junction, partly lined with squamous and largely with gastric cardia-type mucosa with varying degrees of intestinal metaplasia. Locally, a few clusters of glands where the lining epithelium shows a somewhat enlarged and hyperchromatic nuclear pattern. In II, mainly fragments of gastric cardia-type mucosa with varying degrees of intestinal metaplasia. There is mild chronic and also active inflammation, with sometimes pronounced changes in epithelium and stroma. In deeper cuts, the picture becomes more pronounced. Esophageal biopsies at 39 and 37 cm show squamocolumnar junction with intestinal metaplasia classified as low-grade dysplasia.\n\nconclusion: I and II esophageal biopsies show squamocolumnar junction with intestinal metaplasia classified as low-grade dysplasia.\n\nbarrett_label: LGD",
        "generated_report": "microscopy: There are mucosal fragments partly lined with squamous and largely with gastric cardia-type mucosa with intestinal metaplasia and partly with squamous epithelium. There is a preference for high-grade dysplasia.\n\nconclusion: Esophageal biopsies show squamocolumnar junction with intestinal metaplasia and low-grade dysplasia.\n\nbarrett_label: LGD",
        "report_extracted_label": "LGD"
    },
    {
        "case_id": "RL-1036",
        "original_report": "microscopy: Fragment of gastric-type mucosa with extensive abnormal appearance. There is intestinal metaplasia and extensive chronic, partly active inflammation. There is a tangential margin and an abnormal appearance, with closely packed glandular structures sometimes with complex shapes. The lining epithelium shows infiltration of hyperchromatic nuclei. Also, there is local microcystic dilatation with necrotic intraluminal debris.\n\nconclusion: Esophageal biopsies show gastric-type mucosa with intestinal metaplasia and at least low-grade dysplasia.\n\nbarrett_label: LGD",
        "generated_report": "microscopy: I: fragments of gastric cardia-type mucosa with intestinal metaplasia and extensive reactive stromal and epithelial changes. One biopsy shows a cluster of glandular structures with enlarged and rounded nuclei, variation in the shape and size, stacking of elongated and hyperchromatic nuclei. There is a pronounced aspect of the epithelium with multilayering and clear mucinous differentiation. Differential diagnosis considers low-grade dysplasia and reactive changes. One biopsy shows a cluster of glandular structures with enlarged and rounded nuclei, variation in the shape and size, stacking of elongated and hyperchromatic nuclei. There is a pronounced aspect of the foveolar layer and extensive reactive stromal and epithelial changes. One biopsy shows a cluster of glandular structures with enlarged and rounded nuclei, variation in the shape and size, stacking of elongated and hyperchromatic nuclei, variation in the shape and diameter of the glandular structures, the lining epithelium shows an abnormal aspect with stacking and elongation of the nuclear image. The epithelium shows enlarged and rounded nuclei, variation in the shape and size, stacking, increased polymorphism, and loss of polarity. Due to tangential sectioning, there is a preference for a reactive cell picture and low-grade dysplasia.\n\nconclusion: I esophageal biopsies of columnar mucosa with intestinal metaplasia and reactive epithelial changes. No indications of dysplasia or Helicobacter pylori is identified.\n\nbarrett_label: LGD",
        "report_extracted_label": "LGD"
    },
    {
        "case_id": "RL-1037",
        "original_report": "microscopy: There are mucosal fragments partly lined with squamous and partly with gastric-type mucosa with intestinal metaplasia. There is mild chronic active inflammation and reactive epithelial and stromal changes. The image is difficult to interpret and is preferably classified as reactive.\n\nconclusion: Esophageal biopsies show squamocolumnar junction with intestinal metaplasia, mild active inflammation, and reactive epithelial changes.\n\nbarrett_label: ND",
        "generated_report": "microscopy: I: fragmented mucosal fragments lined with squamous and largely with gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. Locally, there is a small cluster of glandular structures with an abnormal aspect with more densely packed glandular structures and a slightly enlarged and hyperchromatic nuclei. II and III show multiple mucosal fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. Locally, there is a small cluster of glandular structures with an abnormal aspect with more densely packed glandular structures and a slightly enlarged and hyperchromatic nuclei. II and III show multiple mucosal fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. Locally, there is a small cluster of glandular structures with lining epithelium shows enlarged and hyperchromatic nuclei. In one biopsy, there is a small cluster of glandular structures with an abnormal aspect with more densely packed glandular structures and a slightly enlarged and hyperchromatic nuclei, some stacking of elongated and hyperchromatic nuclei. In one biopsy, there is a small cluster of glandular structures with an abnormal aspect with more densely packed glandular structures and a clearly disturbed nuclear-cytoplasmic ratio, and microd of a reactive cell picture and low-grade dysplasia.\n\nconclusion: I and IV esophageal biopsy: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes.\n\nbarrett_label: LGD",
        "report_extracted_label": "ND"
    },
    {
        "case_id": "RL-1038",
        "original_report": "microscopy: Squamocolumnar junction with intestinal metaplasia and reactive changes.\n\nconclusion: Esophageal biopsies show squamocolumnar junction with intestinal metaplasia and reactive changes.\n\nbarrett_label: ND",
        "generated_report": "microscopy: I: Fragments at the site of the squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: Columnar mucosa with intestinal metaplasia and reactive epithelial changes. \nII: Columnar mucosa with intestinal metaplasia and reactive epithelial changes. \nII: Columnar mucosa with intestinal metaplasia and reactive epithelial changes. \nII: Columnar mucosa with intestinal metaplasia and reactive epithelial changes. \nII: Columnar mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes",
        "report_extracted_label": "ND"
    },
    {
        "case_id": "RL-1039",
        "original_report": "microscopy: A mucosal fragment is partly lined with squamous and partly with gastric-type mucosa showing intestinal metaplasia. In the background, there is mild chronic and active inflammation. A portion of the glandular structures shows abnormal epithelial lining with hyperchromasia, elongation, and stratification. II shows an ulcer base with several abnormal fragments of epithelium, partly indefinite for dysplasia.\n\nconclusion: I esophageal biopsies: squamocolumnar junction with intestinal metaplasia and low-grade dysplasia of columnar-type epithelium. II esophageal biopsies: gastric-type mucosa with intestinal metaplasia and ulcerating inflammation, best classified as indefinite for dysplasia.\n\nbarrett_label: IND",
        "generated_report": "microscopy: There are mucosal fragments partly lined with squamous and largely with gastric cardia-type mucosa with intestinal metaplasia and partly with gastric cardia-type mucosa with intestinal metaplasia and partly with squamous epithelium. There is a background of mild chronic and active inflammation and reactive epithelial changes.\n\nconclusion: Esophageal biopsies show squamocolumnar junction with intestinal metaplasia and reactive epithelial changes.\n\nbarrett_label: LGD",
        "report_extracted_label": "LGD"
    },
    {
        "case_id": "RL-1040",
        "original_report": "microscopy: There are fragments of gastric-type mucosa, partly with intestinal metaplasia. In the background, there is mild chronic inflammation. A portion of the epithelium, particularly in the glandular layer, shows a slightly abnormal appearance with hyperchromatic and enlarged glandular structures. One gland shows intraluminal debris. In additional slides, the appearance is regular.\n\nconclusion: Esophageal biopsies show gastric-type mucosa with intestinal metaplasia and reactive epithelial changes. No dysplasia is identified.\n\nbarrett_label: ND",
        "generated_report": "microscopy: I: Fragments of gastric cardia-type mucosa with intestinal metaplasia and mild to moderate chronic inflammation. In one biopsy, there is a microscopically more disturbed. In one biopsy, there is a microscopically more disturbed. In one biopsy, there is a microscopically circumscribed cluster of glandular structures in the glandular layer. II and III show columnar mucosa with intestinal metaplasia and reactive epithelial changes. In one biopsy, there is a microscopically circumscribed cluster of glandular structures in the glandular layer. II and III show columnar mucosa with intestinal metaplasia and reactive epithelial changes. In one biopsy, there is a microscopically more disturbed and tangentially affected and shows a somewhat disordered arrangement of the nuclear pattern. The focus is relatively circumscribed compared to the surrounding glandular structures, the lining epithelium shows an abnormal aspect with enlargement, hyperchromasia, and nuclear pattern. \nVII and III: Esophageal biopsies show columnar mucosa with intestinal metaplasia and reactive epithelial changes. No indications of dysplasia are identified.\n\nbarrett_label: LGD",
        "report_extracted_label": "ND"
    },
    {
        "case_id": "RL-1041",
        "original_report": "microscopy: I: fragmented fragments of esophageal mucosa partly lined with squamous and partly with gastric cardia-type mucosa with intestinal metaplasia. In the glandular layer, there is scattered hyperchromasia with maturation towards the surface. \nII: a single fragment of gastric cardia-type mucosa with an abnormal appearance. In the lamina propria, there is an influx of a mixed nuclear infiltrate, partly with neutrophils overlying the lining epithelium. There are extreme glandular configurations and part of the lining epithelium shows enlarged, hyperchromatic, and irregularly placed nuclei. Differential diagnosis considers dysplasia and reactive nuclear appearance, suggesting inflammation. There is a preference for low-grade dysplasia. \nIII: fragmented fragments of gastric-type mucosa with extensive intestinal metaplasia on a background of moderately extensive chronic and minor active inflammation. There is partly tangential sectioning. \nII gastric-type mucosa with intestinal metaplasia and high-grade dysplasia.\n\nconclusion: I esophageal biopsies show squamocolumnar junction with intestinal metaplasia and reactive epithelial changes, no dysplasia. II esophageal biopsies show gastric-type mucosa with intestinal metaplasia and high-grade dysplasia. III esophageal biopsies show gastric-type mucosa with mild chronic inflammation and reactive epithelial changes, no dysplasia.\n\nbarrett_label: HGD",
        "generated_report": "microscopy: I shows fragments of gastric cardia-type mucosa with intestinal metaplasia and a few glands with intraluminal necrotic debris. The lining epithelium shows elongated and stratified nuclear pattern with stacking of elongated and hyperchromatic nuclei. There is a pronounced aspect of the foveolar layer. The lining epithelium shows elongated and stratified nuclear pattern with stacking of elongated and hyperchromatic nuclei. There is a pronounced aspect of the foveolar layer. The lining epithelium shows elongated and stratified nuclear pattern with stacking of elongated and hyperchromatic nuclei. There is a pronounced aspect of the nuclear pattern. Epithelium is seen with a disturbed nuclear-cytoplasmic ratio and a slightly abnormal aspect of the nuclear pattern is moderately the nuclear pattern. The polarity is sometimes lost, with a differential diagnosis of dysplasia.\n\nbarrett_label: LGD",
        "report_extracted_label": "HGD"
    },
    {
        "case_id": "RL-1042",
        "original_report": "microscopy: There are mucosal fragments partly lined with squamous and largely consisting of gastric cardia-type mucosa with some intestinal metaplasia. In one of the series of sections, there is a tangentially cut focus of glandular structures where the lining epithelium shows a slightly hyperchromatic and elongated nuclear appearance, including goblet cells. This focus is not visible in the earlier and deeper sections. Differential diagnosis considers a reactive and tangential image of the proliferation zone versus low-grade dysplasia.\n\nconclusion: Esophageal biopsies show squamocolumnar junction with intestinal metaplasia and epithelial changes best classified as low-grade dysplasia.\n\nbarrett_label: LGD",
        "generated_report": "microscopy: I: fragmented gastric corpus and cardia-type mucosa with mild chronic inflammation. In one biopsy, there is a circumscribed area of glandular structures with an abnormal aspect of extension along the foveolar surface. There is a disturbed nuclear-cytoplasmic ratio. These findings are best classified as indefinite for dysplasia.\n\nconclusion: I and IV biopsies: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes.\n\nconclusion: I and III esophageal biopsies: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes.\n\nconclusion: I and III, there is a circumscribed area of glandular structures with an abnormal aspect of extension along the foveolar surface. In the lamina propria, there is a circumscribed area of glandular structures with an abnormal aspect of extension along the foveolar surface. In the lamina propria, there is a circumscribed area of glandular structures with an abnormal aspect of extension along the foveolar surface. In the lamina propria, there is a circumscribed area of glandular structures with an abnormal aspect of extension along the foveolar surface. In the lamina propria, there is a circumscribed area of glandular structures with an abnormal aspect of extension along the foveolar surface. In the lamina propria, there is a circumscribed area of glandular structures with an abnormal aspect of extension along the foveolar surface. In the lamina propria, there is a circumscribed area of glandular structures with an abnormal aspect of extension along the foveolar surface. In the lamina propria, there is a circumscribed area of glandular structures with an abnormal aspect of extension along the foveolar surface. In the lamina propria, there is a circumscribed area of glandular structures with an abnormal aspect of extension",
        "report_extracted_label": "LGD"
    },
    {
        "case_id": "RL-1043",
        "original_report": "microscopy: There are mucosal fragments partly consisting of squamous and largely of gastric-type mucosa with intestinal metaplasia. Two of the biopsies show an abnormal aspect, where the lining epithelium exhibits an enlarged, hyperchromatic, and sometimes stratified nuclear pattern. This abnormal morphology is present extensively from the base to the surface, with no maturation. Differential diagnosis considers an extensive reactive picture and extensive low-grade dysplasia. In one gastric-type mucosa biopsy, a reactive picture of both stroma and epithelium is seen, with a clearly different aspect.\n\nconclusion: Esophageal biopsies show squamocolumnar junction with intestinal metaplasia and epithelial changes, preferably classified as low-grade dysplasia.\n\nbarrett_label: LGD",
        "generated_report": "microscopy: There are mucosal fragments partly lined with squamous and largely with gastric cardia-type mucosa with intestinal metaplasia. In one biopsy, there is a slightly enlarged nuclear appearance. In the lamina propria, a mild chronic and active inflammation and reactive epithelial changes.\n\nconclusion: Esophageal biopsies show squamocolumnar junction with intestinal metaplasia and low-grade dysplasia.\n\nbarrett_label: LGD",
        "report_extracted_label": "LGD"
    },
    {
        "case_id": "RL-1044",
        "original_report": "microscopy: In I-I 3, there is a corresponding picture of fragments of gastric-type mucosa with extensive intestinal metaplasia and a somewhat deviating and difficult to interpret aspect. There are pronounced architectural filiform changes, no stromal changes with reactive granulating stroma, and some activity. The lining epithelium shows partial hyperchromasia, elongation, and stratification. Differential diagnosis considers reactive changes in the context of inflammation and regeneration. There is a preference for a reactive cell picture. In IV and V, there are each fragments of gastric-type mucosa with extensive intestinal metaplasia and partial lining with squamous epithelium.\n\nconclusion: I- III esophageal biopsies: gastric-type mucosa with intestinal metaplasia, some active inflammation, and pronounced reactive epithelial and stromal changes. No dysplasia. IV and V esophageal biopsies: squamocolumnar junction with intestinal metaplasia, no dysplasia.\n\nbarrett_label: ND",
        "generated_report": "microscopy: I: Fragments entirely consist of a proliferation. There is a cribriform arrangement and morphological aspect of the foveolar layer shows a somewhat hyperchromatic aspect, with enlarged and irregularly shaped nuclei. There is a cribriform arrangement and disturbed nuclear-cytoplasmic ratio. The differential diagnosis considers low-grade and high-grade dysplasia.\n\nconclusion: I and fragments of gastric cardia-type mucosa with intestinal metaplasia and a regular hyperchromatic aspect as seen.\n\nconclusion: I and III esophageal biopsies: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. II shows fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. II shows fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. II shows fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. II shows low-grade dysplasia with some active inflammation. \nII: Columnar mucosa with intestinal metaplasia and reactive epithelial changes. II shows low-grade dysplasia with some active inflammation. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. II shows fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments",
        "report_extracted_label": "ND"
    },
    {
        "case_id": "RL-1045",
        "original_report": "microscopy: I shows fragments of gastric-type mucosa with extensive intestinal metaplasia. Part of the material is tangentially affected and shows some crowding of the glandular layer. In none of the biopsies is there a pronounced nuclear pattern with some hyperchromasia. There is also some activity and the aspect of a healed erosion. In II, there are fragments of gastric-type mucosa with intestinal metaplasia and pronounced epithelial-stromal changes. Locally, also some hyperchromasia. In III, there is a similar picture.\n\nconclusion: I esophageal biopsies: gastric-type mucosa with intestinal metaplasia and epithelial changes best classified as indefinite for dysplasia, with a preference for a reactive cell picture. II-III esophageal biopsies: gastric-type mucosa with intestinal metaplasia, varying degrees of activity, and reactive epithelial changes, no dysplasia.\n\nbarrett_label: IND",
        "generated_report": "microscopy: I: fragments of gastric corpus-type mucosa with some intestinal metaplasia. There is a striking epithelial component, including abnormal appearance. The lining epithelium shows elongated and stratified nuclear pattern with stacking and elongation of glandular structures and a rounded and disordered nuclear arrangement. Stromal tissue is partially mechanically nuclear-cytoplasmic ratio. In the glandular layer, there is a compact and more complex architecture. Part of the epithelium shows an abnormal aspect with stacking and elongation of glandular structures and locally a more complex architecture and maturation. The epithelium shows elongated and hyperchromatic nuclei. A few places seem to be absent, but an abnormal aspect of the material is tangentially affected and shows and partly tangentially affected fragments with a disturbed nuclear-cytoplasmic ratio. In the glandular layer, there is a compact and more complex architecture. In the glandular layer, there is a compact and more complex architecture. In the glandular layer, there is a compact and more complex architecture. In the glandular layer, there is a compact and more complex architecture. In the glandular layer, there is a preference for low-grade dysplasia.\n\nconclusion: I and III biopsies with intestinal metaplasia and reactive epithelial changes. No indications of dysplasia or intestinal metaplasia. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. No indications for dysplasia or malignancy.\n\nbarrett_label: HGD",
        "report_extracted_label": "ND"
    },
    {
        "case_id": "RL-1046",
        "original_report": "microscopy: I shows fragmented mucosal fragments lined with gastric-type mucosa with intestinal metaplasia and stratified squamous epithelium. There are reactive stromal and epithelial changes. \nII shows fragmented mucosal biopsies consisting of gastric corpus and cardia-type mucosa with intestinal metaplasia and ulcer base material. There is an abnormal nuclear image in the lining epithelium, including alternating stratification of elongated and hyperchromatic nuclei, and partly rounded and enlarged nuclei with disturbed orientation.\n\nconclusion: I esophageal biopsies: squamocolumnar junction with intestinal metaplasia and focal epithelial changes, classified as indefinite for dysplasia. \nII esophageal biopsies: Barrett segment with (at least) high-grade dysplasia of columnar mucosa, suspicious for adenocarcinoma, though possible invasive growth is not detectable in this material.\n\nbarrett_label: HGD",
        "generated_report": "microscopy: There are mucosal fragments partly lined with squamous and largely with gastric cardia-type mucosa with intestinal metaplasia and a fragment of squamous epithelium. A portion of the epithelium shows stratification of an elongated and stratified nuclear pattern with closely packed glandular structures and slightly enlarged and stratified nuclear pattern. Differential diagnosis considers low-grade dysplasia and a reactive cell picture and nuclear pattern with a disturbed nuclear-cytoplasmic ratio, and a pronounced aspect of the nuclear image is difficult to interpret, there is a cluster of glandular structures with an abnormal aspect. There is a disturbed nuclear-cytoplasmic ratio. The fragment is tangentially affected and shows a disturbed nuclear-cytoplasmic ratio and hyperchromasia of the nuclear image. There is a disturbed nuclear-cytoplasmic ratio, particularly due to fragmentation, where a part of the abnormality shows a preference for low-grade dysplasia.\n\nconclusion: Esophageal biopsies show squamocolumnar junction with intestinal metaplasia and low-grade dysplasia.\n\nbarrett_label: LGD",
        "report_extracted_label": "HGD"
    },
    {
        "case_id": "RL-1047",
        "original_report": "microscopy: I shows biopsies at one site of squamocolumnar junction, partly lined with squamous and largely with gastric-type mucosa with varying degrees of intestinal metaplasia. There is also a fairly extensive neoplastic columnar epithelial component with stacking of hyperchromatic elongated nuclear images. Also, more closely packed neoplastic glands with increased cytonuclear polymorphism, and focally a few glands with a clearly disturbed nuclear cytoplasmic ratio. In addition to low-grade dysplasia, high-grade dysplasia is also considered. \nII shows fragments of gastric-type mucosa with extensive intestinal metaplasia and focal hyperchromasia. \nIII shows a fragmented mucosal biopsy largely lined with gastric-type mucosa with an isthmus of intestinal metaplasia and partly with squamous epithelium. There is fairly extensive chronic inflammation with reactive epithelial stromal changes, and in one of the biopsies, some deviant aspect. The lining epithelium shows a slightly enlarged and hyperchromatic nuclear image.\n\nconclusion: I esophageal biopsies: squamocolumnar junction with intestinal metaplasia and dysplasia, locally best classified as high-grade dysplasia of columnar type epithelium. \nII esophageal biopsies: gastric-type mucosa with intestinal metaplasia and reactive epithelial changes. \nIII esophageal biopsies: squamocolumnar junction with intestinal metaplasia and low-grade dysplasia of columnar type epithelium.\n\nbarrett_label: HGD",
        "generated_report": "microscopy: I: Fragments of gastric-type mucosa with intestinal metaplasia and reactive epithelial changes. Locally, there is a more complex architectural glandular formations and maturation of the epithelium. The lining epithelium shows a somewhat abnormal aspect with enlarged and hyperchromatic nuclei. The abnormalities are largely limited to the glandular layer. In addition, there is a more complex architectural glandular formations and slightly enlarged and hyperchromatic nuclei. The abnormalities are largely limited to the glandular layer. In addition, there is a more complex architectural glandular formations and slightly enlarged and hyperchromatic nuclei. There is a fairly extensive abnormal arrangement and slightly enlarged and hyperchromatic nuclei. There is a mention of differential diagnosis considering high-grade dysplasia and tangential sectioning and cytonuclear atypia.\n\nconclusion: I esophageal biopsies: gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. II esophageal biopsies: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. II esophageal biopsies: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. II esophageal biopsies: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. II esophageal biopsies: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. II esophageal biopsies: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. No indications of dysplasia are identified.\n\nbarrett_label: LGD",
        "report_extracted_label": "HGD"
    },
    {
        "case_id": "RL-1048",
        "original_report": "microscopy: I shows multiple fragments of gastric corpus and cardia-type mucosa without abnormalities. II shows fragments of gastric cardia-type mucosa without abnormalities. Locally, a small squamous component in the form of multinucleated epithelium. III shows two fragments of gastric cardia-type mucosa with intestinal metaplasia. Architecturally, there is a fairly regular arrangement and structure. Cytonuclearly, there is a slightly enlarged and hyperchromatic image in a few places. There seems to be a subtle morphological difference, however, reactive changes are also present in the background. Differential diagnosis considers reactive cell changes and low-grade dysplasia.\n\nconclusion: I and II esophageal biopsies: gastric-type mucosa with mild chronic inflammation and reactive changes. No intestinal metaplasia or dysplasia. III esophageal biopsies: gastric-type mucosa with intestinal metaplasia and limited cytonuclear atypia, best classified as reactive with no dysplasia identified.\n\nbarrett_label: ND",
        "generated_report": "microscopy: I: Fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. Locally, there is a preference for a reactive cell picture and low-grade dysplasia.\n\nconclusion: I and IV esophageal biopsies: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. II shows fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. II shows fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. II shows fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. II shows fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. Locally, there is a preference for a reactive cell picture and low-grade dysplasia.\n\nconclusion: I and IV esophageal biopsies: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: Columnar mucosa with intestinal metaplasia and reactive epithelial changes. \nII: Columnar mucosa with intestinal metaplasia and reactive epithelial changes. \nII: Columnar mucosa with intestinal metaplasia and reactive epithelial changes. \nII: Columnar mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. II: Fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. In one biopsy, there is a preference for a reactive cell picture and low-grade dysplasia.\n\nconclusion: I and IV, and IV: fragments partly lined with gastric cardia-type mucosa with intestinal",
        "report_extracted_label": "ND"
    },
    {
        "case_id": "RL-1049",
        "original_report": "microscopy: I shows fragments of gastric-type mucosa with intestinal metaplasia. In one biopsy, there is a somewhat deviant aspect with tufting/microscopic papillary epithelial projections and a disordered nuclear arrangement in the foveolar layer. There is evidence of active inflammation and regeneration, with fibrosis and granulation in the lamina propria with loss of glandular structures. The deeper sections show a less pronounced abnormality. Differential diagnosis considers reactive epithelial changes versus low-grade dysplasia, with a preference for a reactive process. II shows mucosal fragments at the squamocolumnar junction with reactive changes.\n\nconclusion: I esophageal biopsies of the aphthous lesion: gastric-type mucosa with intestinal metaplasia, active inflammation, and regeneration. There are reactive epithelial changes, no dysplasia. II esophageal biopsies: squamocolumnar junction with intestinal metaplasia, no dysplasia.\n\nbarrett_label: ND",
        "generated_report": "microscopy: I shows fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. II shows fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation, no intestinal metaplasia, no dysplasia. II shows fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation, no intestinal metaplasia, no dysplasia. II shows fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation, no intestinal metaplasia, no dysplasia. II shows fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation, and reactive epithelial changes.\n\nconclusion: I to VI esophageal biopsies: columnar mucosa with intestinal metaplasia and focal active inflammation, and reactive epithelial changes.\n\nconclusion: Esophageal biopsies show columnar mucosa with intestinal metaplasia and low-grade dysplasia.\n\nbarrett_label: LGD",
        "report_extracted_label": "ND"
    },
    {
        "case_id": "RL-1050",
        "original_report": "microscopy: I: fragments of gastric-type mucosa with intestinal metaplasia. There is extensive abnormal architectural and cytonuclear morphology, including closely spaced glandular structures with varying shape and diameter, microcystic dilation with intraluminal necrotic debris, and a clearly disturbed nuclear-cytoplasmic ratio. \nII-VIII: fragments of gastric-type mucosa with varying degrees of intestinal metaplasia and Paneth cell metaplasia. Background shows mild inflammation and inflammatory-like changes. The image is difficult to interpret, with pronounced nuclear atypia in the glandular layer and morphological changes suggestive of a possible leap in dysplasia. Along the surface, there is a four-layered arrangement of epithelium. Differential diagnosis considers low-grade dysplasia and reactive changes. Otherwise, best classified as indefinite for dysplasia. \nVIII: fragments of gastric-type mucosa with intestinal metaplasia and epithelial changes best classified as indefinite for dysplasia. \nIX: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes, no dysplasia.\n\nconclusion: I esophageal biopsies show gastric-type mucosa with intestinal metaplasia and at least high-grade dysplasia. II-VII show reactive epithelial changes. VIII shows epithelial changes best classified as indefinite for dysplasia. IX shows squamocolumnar junction with intestinal metaplasia and reactive epithelial changes, no dysplasia.\n\nbarrett_label: HGD",
        "generated_report": "microscopy: I: fragments of gastric cardia-type mucosa with intestinal metaplasia and a fairly extensive abnormal arrangement and maturation of the epithelium. Locally, there is a deviating aspect with enlarged and hyperchromatic nuclei. There is a striking aspect of the foveolar layer. The lining epithelium shows normal architecture and maturation. The material was reviewed in the context of panel evaluation.\n\nconclusion: I and III esophageal biopsies: columnar-type mucosa with intestinal metaplasia and reactive epithelial changes. II: Fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. II shows fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. II shows fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: Fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: Fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: Fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: Columnar mucosa with intestinal metaplasia and reactive epithelial changes. \nII: Fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. In one biopsy, there is a preference for high-grade dysplasia.\n\nconclusion: I and IV esophageal biopsies show columnar mucosa with intestinal metaplasia and reactive epithelial changes. No dysplasia is identified.\n\nbarrett_label: LGD",
        "report_extracted_label": "HGD"
    },
    {
        "case_id": "RL-1051",
        "original_report": "microscopy: The material shows esophageal biopsies of columnar mucosa with intestinal metaplasia and locally low-grade dysplasia. In I and II, there is gastric cardia-type mucosa with low-grade dysplasia on a background of intestinal metaplasia. III and IV show gastric cardia-type mucosa with intestinal metaplasia and reactive background, no dysplasia.\n\nconclusion: I-IV esophageal biopsies show columnar mucosa with intestinal metaplasia. I and II biopsies show low-grade dysplasia. III and IV biopsies show reactive background with no dysplasia.\n\nbarrett_label: LGD",
        "generated_report": "microscopy: I: fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. Locally, there is a circumscribed cluster of glandular structures with lining epithelium shows enlarged and hyperchromatic nuclei. II and III show fragments of gastric cardia-type mucosa with intestinal metaplasia and low-grade dysplasia.\n\nbarrett_label: LGD",
        "report_extracted_label": "LGD"
    },
    {
        "case_id": "RL-1052",
        "original_report": "microscopy: \n\nconclusion: Esophageal biopsies show gastric-type mucosa with low-grade dysplasia on a background of intestinal metaplasia and mild active inflammation.\n\nbarrett_label: LGD",
        "generated_report": "microscopy: I: Fragments of gastric-type mucosa with intestinal metaplasia and reactive epithelial changes. Locally, there is a compact and more complex arrangement. The fragment is tangentially affected and shows a somewhat hyperchromatic and stratified nuclear pattern. The maturation is also observed. In one biopsy, there is a compact and more complex arrangement. The sections are not optimally assessable. Differential diagnosis considers low-grade dysplasia and reactive changes. Locally, there is a compact and more complex arrangement. The sections are not optimally assessable. Differential diagnosis considers low-grade dysplasia and reactive changes. Locally, there is a compact and more complex arrangement. The sections are not optimally assessable. Differential diagnosis considers reactive changes due to inflammation and reactive epithelial changes. \nV: fragmented mucosa with intestinal metaplasia and reactive epithelial changes. \nV: fragmented mucosa with intestinal metaplasia and reactive epithelial changes. \nV: fragmented mucosa with intestinal metaplasia and reactive epithelial changes. \nV: fragmented mucosa with intestinal metaplasia and reactive epithelial changes. \nV: fragmented mucosa with intestinal metaplasia and focal low-grade dysplasia.\n\n \nI: columnar mucosa with intestinal metaplasia and focal low-grade dysplasia.\n\nbarrett_label: LGD",
        "report_extracted_label": "LGD"
    },
    {
        "case_id": "RL-1053",
        "original_report": "microscopy: I Esophageal biopsies at 40 cm: gastric mucosa with mild chronic inflammation. No intestinal metaplasia. II. Esophageal biopsies at 38 cm: columnar-type mucosa with low-grade dysplasia. III. Esophageal biopsies at 36 cm: squamocolumnar junction with intestinal metaplasia and reactive changes, no dysplasia. IV and V. Esophageal biopsies: squamous epithelium with chronic and focal active inflammation and reactive epithelial changes, no dysplasia.\n\nconclusion: I shows gastric mucosa with mild chronic inflammation and no intestinal metaplasia or dysplasia. II shows columnar-type mucosa with low-grade dysplasia. III shows squamocolumnar junction with intestinal metaplasia and reactive changes, no dysplasia. IV and V show squamous epithelium with chronic and focal active inflammation and reactive epithelial changes, no dysplasia.\n\nbarrett_label: LGD",
        "generated_report": "microscopy: I: Fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. Locally, there is a circumscribed cluster of glandular structures with an abnormal aspect with stacking of elongated and slightly hyperchromatic nuclei. II and III show a similar picture indefinite for dysplasia.\n\nbarrett_label: LGD",
        "report_extracted_label": "LGD"
    },
    {
        "case_id": "RL-1054",
        "original_report": "microscopy: Squamocolumnar junction with intestinal metaplasia and neoplastic epithelial changes, where differential diagnosis considers low-grade and high-grade dysplasia. The case was discussed during a consensus meeting.\n\nconclusion: Esophageal biopsies show squamocolumnar junction with intestinal metaplasia and (at least) low-grade dysplasia of columnar mucosa.\n\nbarrett_label: LGD",
        "generated_report": "microscopy: I: Fragments of columnar-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: Esophageal biopsies show squamocolumnar junction with intestinal metaplasia and a picture and low-grade and high-grade dysplasia.\n\nbarrett_label: LGD",
        "report_extracted_label": "LGD"
    },
    {
        "case_id": "RL-1055",
        "original_report": "microscopy: The case shows squamocolumnar junction with intestinal metaplasia and high-grade dysplasia of columnar mucosa.\n\nconclusion: Esophageal biopsies show squamocolumnar junction with intestinal metaplasia and high-grade dysplasia of columnar mucosa.\n\nbarrett_label: HGD",
        "generated_report": "microscopy: There are mucosal fragments partly lined with squamous and partly with gastric cardia-type mucosa with intestinal metaplasia and a difficult-to-interpret epithelial changes, and a pronounced villous aspect of the foveolar layer. The lining epithelium shows an abnormal aspect with enlarged and hyperchromatic nuclei. A few places seem to be absent or reduced in the context of panel assessment (LANS case 58) with the conclusion: Esophageal biopsies show squamocolumnar junction with intestinal metaplasia and at least high-grade dysplasia.\n\nbarrett_label: LGD",
        "report_extracted_label": "HGD"
    },
    {
        "case_id": "RL-1056",
        "original_report": "microscopy: I: squamocolumnar junction with no intestinal metaplasia, dysplasia, or malignancy. \nII: columnar mucosa with intestinal metaplasia, no dysplasia or malignancy. \nIII: columnar mucosa with intestinal metaplasia, no dysplasia or malignancy. \nIV: columnar mucosa with intestinal metaplasia, no dysplasia or malignancy. \nV: columnar mucosa with no intestinal metaplasia, dysplasia, or malignancy.\n\nconclusion: Biopsies from the proximal Barrett segment (targeted) show squamocolumnar junction without intestinal metaplasia, dysplasia, or malignancy. Random biopsies from the distal esophagus show columnar mucosa with intestinal metaplasia in specimens II, III, and IV. No dysplasia or malignancy is identified in any specimen.\n\nbarrett_label: ND",
        "generated_report": "microscopy: I shows fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. One biopsy shows a cluster of glandular structures with enlarged and stratified nuclear pattern. Differential diagnosis considers low-grade dysplasia and reactive epithelial changes.\n\nconclusion: I: fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. One biopsy shows a cluster of glandular structures with enlarged and stratified nuclear pattern. Differential diagnosis considers low-grade dysplasia and reactive epithelial changes.\n\nconclusion: I: fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. Locally, there is a slightly enlarged and hyperchromatic nuclei. In the lamina propria, there is a slightly abnormal aspect of the epithelium with stacking of elongated and hyperchromatic nuclei. In the lamina propria, there is a slightly abnormal aspect of the foveolar layer partially shows a few glands with stacking of elongated and hyperchromatic nuclei. In the lamina propria, there is a slightly abnormal aspect of the foveolar layer partially shows a few glands with stacking of elongated and hyperchromatic nuclei. In the lamina propria, there is a slightly abnormal aspect of the foveolar layer partially shows a regular focus of glandular structures with enlarged and hyperchromatic nuclei. In the lamina propria, there is a slightly abnormal aspect of the nuclear image. The changes are present with mild chronic inflammation and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nV:",
        "report_extracted_label": "ND"
    },
    {
        "case_id": "RL-1057",
        "original_report": "microscopy: There is a minuscule fragment of esophageal mucosa, partly lined with squamous and partly with columnar-type epithelium. In the background, there is mild active inflammation, mainly of the squamous epithelium, with reactive epithelial changes. The squamous epithelium often shows a slightly enlarged rounded nuclear appearance with a distinct nucleolus and sometimes some stratification and loss of polarity. There is also some activity in the glandular epithelial component. Differential diagnosis considers a reactive cellular picture due to inflammation and (high-grade) dysplasia. A clear differentiation jump is not certainly observable, but possibly abnormal in toto. There is a preference for dysplasia.\n\nconclusion: Esophageal biopsies show a squamocolumnar junction with high-grade dysplasia of columnar mucosa. In the background, there is mild active inflammation.\n\nbarrett_label: HGD",
        "generated_report": "microscopy: There are two mucosal fragments, one lined with squamous and three biopsies, characterized by closely packed glandular structures of variable shape and diameter. The lining epithelium shows alternating stratification of elongated and stratified nuclear features suggest at the site of the squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. A part of the epithelium shows stratification of elongated and stratified nuclear features suggest at the site of the squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. A part of the epithelium shows stratification of elongated and stratified nuclear features suggest at the site of the squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. The picture is consistent with high-grade dysplasia of columnar-type epithelium. II esophageal biopsies: squamocolumnar junction with intestinal metaplasia and at least high-grade dysplasia, with preference for high-grade dysplasia.\n\nbarrett_label: HGD",
        "report_extracted_label": "HGD"
    },
    {
        "case_id": "RL-1058",
        "original_report": "microscopy: There are fragmented fragments of gastric-type mucosa with some intestinal metaplasia. There is a background of pronounced foveolar aspect with vascular-rich stroma and reactive changes. Mild activity is present, and a large part of the epithelium shows reactive changes with intact mucous layer. Immunohistochemical examination for p53 shows extensive strong nuclear staining; however, this is interpreted as preference for wild-type with an elevated background.\n\nconclusion: Esophageal biopsies show columnar mucosa with extensive reactive and regenerative changes on a background of active inflammation and limited activity. No dysplasia is identified.\n\nbarrett_label: ND",
        "generated_report": "microscopy: I: fragments of gastric cardia-type mucosa with intestinal metaplasia and a small nucleolus. Differential diagnosis considers low-grade dysplasia and a tangentially affected and are partly lined with gastric-type mucosa with intestinal metaplasia. There is a fairly extensive abnormal arrangement and maturation of the epithelium. The lining epithelium shows elongated and stratified nuclear pattern with stacking of elongated and hyperchromatic nuclei. There is a fairly extensive abnormal arrangement and maturation of the epithelium. The lining epithelium shows elongated and stratified nuclear pattern with stacking of elongated and hyperchromatic nuclei. There is a fairly extensive abnormal arrangement and maturation of the epithelium. The lining epithelium shows elongated and stratified nuclear pattern with stacking of elongated and hyperchromatic nuclei. There is a fairly extensive abnormal arrangement and maturation of the epithelium. The lining epithelium shows elongated and stratified nuclear pattern with stacking of elongated and hyperchromatic nuclei. There is a fairly extensive abnormal arrangement and maturation of the epithelium. The lining epithelium shows enlarged and hyperchromatic nuclei. There is a preference for high-grade and high-grade dysplasia.\n\nbarrett_label: LGD",
        "report_extracted_label": "ND"
    },
    {
        "case_id": "RL-1059",
        "original_report": "microscopy: There are small fragments of esophageal biopsy material, partly lined with squamous and largely with gastric-type mucosa. There are extensive reactive changes in the presence of minor activity. Locally, there are circumscribed glandular foci where the lining epithelium does not clearly show enlarged nuclear morphology with pleomorphism.\n\nconclusion: Esophageal biopsies show squamocolumnar junction with intestinal metaplasia and focal low-grade dysplasia of columnar-type epithelium. In the background, there is minor active inflammation.\n\nbarrett_label: LGD",
        "generated_report": "microscopy: There are mucosal fragments partly lined with squamous and largely with gastric cardia-type mucosa with intestinal metaplasia and a fragment of squamous epithelium. In one biopsy, there is a preference for a reactive cell picture.\n\nconclusion: Esophageal biopsies show squamocolumnar junction with intestinal metaplasia and epithelial changes best classified as low-grade dysplasia.\n\nbarrett_label: LGD",
        "report_extracted_label": "LGD"
    },
    {
        "case_id": "RL-1060",
        "original_report": "microscopy: There are two fragments at the site of the squamocolumnar junction with varying degrees of intestinal metaplasia. In part of the biopsies, there is a slightly abnormal aspect with more closely packed glandular structures and some nuclear stacking. Here, there is also mild chronic inflammation. Differential diagnosis considers a reactive (tangentially sectioned) picture with inflammation and dysplasia.\n\nconclusion: Esophageal biopsies show squamocolumnar junction with intestinal metaplasia and epithelial changes indefinite for dysplasia.\n\nbarrett_label: IND",
        "generated_report": "microscopy: There are mucosal fragments partly lined with squamous and largely of gastric cardia-type mucosa with intestinal metaplasia and partly with squamous epithelium. There is a preference for low-grade dysplasia.\n\nconclusion: Esophageal biopsies show squamocolumnar junction with intestinal metaplasia and reactive epithelial changes.\n\nbarrett_label: LGD",
        "report_extracted_label": "IND is not one of the allowed labels according to the provided hierarchy. Based on the methodology:\n\n- We first look at the \"conclusion\" section.\n- The conclusion states: \"Esophageal biopsies show squamocolumnar junction with intestinal metaplasia and epithelial changes indefinite for dysplasia.\"\n- The phrase \"indefinite for dysplasia\" indicates that dysplasia cannot be definitively diagnosed, and no definitive dysplastic changes (low-grade or high-grade) are confirmed.\n- Therefore, the most severe confirmed finding is **No Dysplasia (ND)**.\n\nCorrect Output: **ND**"
    },
    {
        "case_id": "RL-1061",
        "original_report": "microscopy: I shows fragments of squamocolumnar junction with reactive changes, no intestinal metaplasia, no dysplasia. II shows multiple fragments of squamocolumnar junction, mainly consisting of gastric-type mucosa with groove metaplasia and intestinal metaplasia. There are focal epithelial abnormalities with features concerning for dysplasia.\n\nconclusion: I esophageal biopsies: squamocolumnar junction with reactive epithelial changes, no intestinal metaplasia, no dysplasia. II esophageal biopsies: squamocolumnar junction with intestinal metaplasia and focal epithelial abnormalities, best classified as low-grade dysplasia.\n\nbarrett_label: LGD",
        "generated_report": "microscopy: I: Fragments of gastric-type mucosa with intestinal metaplasia and moderately extensive active inflammation. One biopsy shows a cluster of glandular structures with enlarged and hyperchromatic nuclei. The fragments are partly lined with cylindrical epithelium and partly with gastric cardia-type mucosa with intestinal metaplasia. In one biopsy, there is a circumscribed area of glandular structures with an abnormal aspect with stacking of an elongated nuclear images. There is a disturbed nuclear-cytoplasmic ratio, and a fragment of squamous epithelium. The lining epithelium shows preserved maturation. The nuclear features epithelium without abnormalities. II: Fragments of gastric-type mucosa with intestinal metaplasia and moderately extensive active inflammation. In one biopsy, there is a circumscribed area of glandular structures with an abnormal aspect with stacking of an elongated nuclear images. There is a disturbed nuclear-cytoplasmic ratio. These are mostly smaller and somewhat deviant focus is seen. The lamina propria shows a fibrous aspect of the epithelium shows enlarged and hyperchromatic nuclei. \nII: Columnar mucosa with intestinal metaplasia and reactive epithelial changes.\n\nbarrett_label: LGD",
        "report_extracted_label": "LGD"
    },
    {
        "case_id": "RL-1062",
        "original_report": "microscopy: Fragments at the site of the squamocolumnar junction show varying degrees of intestinal metaplasia. In a portion of the biopsies, there is an abrupt deviant aspect with more densely packed glandular structures, nuclear enlargement, and some stacking of nuclear features. Here, there is also mild chronic inflammation.\n\nconclusion: Esophageal biopsies show columnar mucosa with intestinal metaplasia and locally low-grade dysplasia.\n\nbarrett_label: LGD",
        "generated_report": "microscopy: I: Fragments at the site of the biopsy is composed of squamous and the glandular structures, the lining epithelium shows an elongated nuclear appearance with slightly pronounced nuclear appearance of the foveolar layer with some stratification. Differential diagnosis considers a healing ulcer and a neoplastic lesion such as microcarcinoidosis or neuroendocrine tumor. The focus is very limited to the glandular layer with an abnormal aspect where the glandular structures, the lining epithelium shows an enlarged and hyperchromatic nuclear appearance. Locally, there is a cluster of glandular structures where the lining epithelium shows an enlarged nuclear appearance with slightly pronounced nuclear appearance of the foveolar layer with some stratification. Differential diagnosis considers a healing ulcer and a neoplastic lesion such as microcarcinoidosis or neuroendocrine tumor. The focus is very limited to the glandular layer with an abnormal aspect where the entire epithelial lining, showing smaller, somewhat deviant aspect lined with squamous and regularly arranged glandular structures are seen where the lining epithelium shows an enlarged and hyperchromatic nuclear appearance. In the lamina propria, there is a cluster of glandular structures where the lining epithelium shows an enlarged and hyperchromatic nuclear features and intraepithelial lymphocytes and plasma cells, lymphocytes, and plasma cells, lymphocytes, and plasma cells, lymphocytes, and plasma cells, lymphocytes, and plasma cells, lymphocytes, and plasma cells, and lymphocytes, plasma cells, lymphocytes, and plasma cells, and lymphocytes and plasma cells, and lymphocytes are present. In the lamina propria, there is a cluster of glandular structures where the lining epithelium shows an enlarged and hyperchromatic nuclear appearance. The abnormalities are present in the deeper layers.\n\nconclusion: Esophageal biopsies show columnar mucosa with intestinal metaplasia and focal",
        "report_extracted_label": "LGD"
    },
    {
        "case_id": "RL-1063",
        "original_report": "microscopy: In I to IV, there are multiple fragments of gastric-type mucosa with varying degrees of intestinal metaplasia and inflammation. There are variably extensive reactive epithelial and stromal changes. V shows fragments of gastric-type mucosa without intestinal metaplasia. In one of the biopsies, minor variation in nuclear size, shape, arrangement, and chromasia is seen. In the background, there is some active inflammation and reactive stromal changes.\n\nconclusion: I to IV esophageal biopsies: squamocolumnar junction with columnar mucosa with intestinal metaplasia, minor chronic active inflammation, and reactive epithelial changes. No dysplasia. V esophageal biopsy: columnar mucosa with minor activity of epithelial changes indefinite for dysplasia.\n\nbarrett_label: IND",
        "generated_report": "microscopy: I shows fragments of gastric cardia-type mucosa with intestinal metaplasia and a fragment of squamous epithelium. There is a pronounced aspect of the foveolar layer. The lining epithelium shows elevation and hyperchromasia. The differential diagnosis considers low-grade dysplasia, a tangentially affected and shows a somewhat pronounced aspect of the lining epithelium shows a disturbed nuclear-cytoplasmic ratio and hyperchromasia. The differential diagnosis considers low-grade dysplasia, a tangentially affected and the fragments with intestinal metaplasia. The background shows chronic and active inflammation and reactive epithelial changes. In one biopsy, there is a preference for high-grade dysplasia.\n\nconclusion: I and III esophageal biopsies: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. \nIII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nIII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nIII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nIII: Squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. \nIII: Squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. \nIII: Squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. No intestinal metaplasia or dysplasia. \nII: fragments of gastric cardia-type mucosa with mild chronic inflammation and reactive epithelial changes. No intestinal metaplasia or dysplasia. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and a fragment aspect of the glandular layer, and a disturbed nuclear-cytoplasmic ratio. However, and III and III esophageal mucosa. There is",
        "report_extracted_label": "ND"
    },
    {
        "case_id": "RL-1064",
        "original_report": "microscopy: Columnar, gastric-type mucosa with intestinal metaplasia, mild activity, and epithelial changes indefinite for dysplasia.\n\nconclusion: I: Esophageal biopsies show gastric-type mucosa with intestinal metaplasia, active inflammation, and epithelial changes indefinite for dysplasia. II and III: Esophageal biopsies show gastric-type mucosa without intestinal metaplasia or dysplasia.\n\nbarrett_label: IND",
        "generated_report": "microscopy: I shows fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. Locally, there is a small cluster of glandular structures with an abnormal aspect of the glandular layer. There are reactive epithelial changes and low-grade dysplasia.\n\nconclusion: I and IV show fragments lined with gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes.\n\nbarrett_label: LGD",
        "report_extracted_label": "ND"
    },
    {
        "case_id": "RL-1065",
        "original_report": "microscopy: Fragments of esophageal mucosa are partly lined with squamous epithelium and partly with glandular epithelium. Densely packed glandular structures lined with cylindrical epithelium are observed, showing crowding, variable hyperchromasia, and nuclear enlargement with small nucleoli. Extensive Paneth cell metaplasia is present. A clear morphological distinction between reactive changes and dysplasia is difficult to demonstrate. Differential diagnosis includes reactive epithelial changes and dysplasia, with a preference for dysplasia.\n\nconclusion: Esophageal biopsies show squamocolumnar junction with intestinal metaplasia and epithelial changes that are difficult to classify, leaning towards high-grade dysplasia based on panel evaluation.\n\nbarrett_label: HGD",
        "generated_report": "microscopy: There are mucosal fragments partly lined with squamous and largely with gastric cardia-type mucosa with a limited degree of stratification. Part of the epithelium shows an abnormal aspect with clusters of glandular structures with enlarged and somewhat stratified nuclear features suggest at the squamocolumnar junction with intestinal metaplasia and a transition to an abnormal aspect. In deeper sections, the picture is consistent with neoplasia, with a preference for a reactive cell picture.\n\nconclusion: Esophageal biopsies show squamocolumnar junction with intestinal metaplasia and low-grade dysplasia.\n\nbarrett_label: LGD",
        "report_extracted_label": "HGD"
    },
    {
        "case_id": "RL-1066",
        "original_report": "microscopy: These mucosal fragments are partly lined with squamous and partly with gastric-type mucosa. There are extensive reactive changes with multilayering of the foveolar layer. Scattered, there is mild chronic active inflammation.\n\nconclusion: Esophageal biopsies show squamocolumnar junction with chronic active inflammation and reactive epithelial changes.\n\nbarrett_label: ND",
        "generated_report": "microscopy: I shows fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. In one of the biopsies, there is a preference for a neoplastic component. II: gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. In the lamina propria, there is a preference for a neoplastic component. II: gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. In the lamina propria, there is a preference for a neoplastic component. II: gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. In the lamina propria, there is a preference for a neoplastic component. II: gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: Columnar mucosa with intestinal metaplasia and reactive epithelial changes. \nII: Columnar mucosa with intestinal metaplasia and reactive epithelial changes. \nII: gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. In one of the biopsies, there is a preference for a neoplastic component. \nVI shows a fragment with hyperchromasia, elongation, and some squamous epithelium is present. The nuclear image diagnosis considers low-grade dysplasia.\n\nconclusion: Esophageal biopsies show columnar mucosa with intestinal metaplasia and reactive epithelial changes.",
        "report_extracted_label": "ND"
    },
    {
        "case_id": "RL-1067",
        "original_report": "microscopy: Multiple sections through fragments of gastric-type mucosa with varying degrees of intestinal metaplasia and reactive epithelial changes. Focally in II and III, there are epithelial areas with an abnormal appearance, including an abruptly different epithelial lining with enlarged and somewhat irregularly placed nuclear image. In IV, the cytonuclear and architectural changes are more pronounced.\n\nconclusion: I to VII esophageal biopsies from distal to proximal show gastric-type mucosa with intestinal metaplasia. I, V, VI, and VII biopsies show reactive epithelial changes. II and III biopsies show low-grade dysplasia. IV biopsy shows high-grade dysplasia.\n\nbarrett_label: HGD",
        "generated_report": "microscopy: I shows fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. II shows fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. II shows fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. II shows fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. Locally, there is a reactive cell picture.\n\nconclusion: I: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. II shows fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. II shows fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. II shows fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. No dysplasia is identified.\n\nbarrett_label: LGD",
        "report_extracted_label": "HGD"
    },
    {
        "case_id": "RL-1068",
        "original_report": "microscopy: I shows fragments of columnar mucosa with some reactive changes. No dysplasia is identified. \nIII shows mucosal fragments partly lined with squamous and partly with gastric-type mucosa with intestinal metaplasia. In two of the biopsies, there are glandular foci on the lining epithelium with enlarged and hyperchromatic nuclear appearance. Multiple fragments of superficial esophageal mucosa with locally gastric-type mucosa with minimal intestinal metaplasia. \n\nThe case was also reviewed in the context of panel evaluation (LANS 1068):\nI Esophageal biopsies: columnar mucosa with intestinal metaplasia and epithelial changes indefinite for dysplasia.\nII Esophageal biopsies: squamocolumnar junction with intestinal metaplasia and low-grade dysplasia of columnar mucosa.\n\nconclusion: I Esophageal biopsies: columnar mucosa with intestinal metaplasia and epithelial changes indefinite for dysplasia, with some preference for a reactive appearance.\nII Esophageal biopsies: squamocolumnar junction with intestinal metaplasia and low-grade dysplasia of columnar mucosa.\nIII Esophageal biopsies: columnar mucosa with intestinal metaplasia and reactive epithelial changes.\n\nbarrett_label: LGD",
        "generated_report": "microscopy: I: fragmented mucosal fragments lined with gastric cardia-type mucosa with intestinal metaplasia and mild to moderate chronic inflammation. In one biopsy, there is a small cluster of glandular structures in the glandular layer. II and III show multiple mucosal fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. II shows fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. II shows fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. II shows fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. II shows fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. II shows fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: Fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: Fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: Fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: Columnar mucosa with intestinal metaplasia and reactive epithelial changes. \nII: Columnar mucosa with intestinal metaplasia and reactive epithelial changes. \nII: Fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. In one biopsy, there is a small cluster of glandular structures in the glandular layer. Here, there is a small cluster of glandular structures in the glandular layer. \nVI: Fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. II shows fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. In one of the",
        "report_extracted_label": "LGD"
    },
    {
        "case_id": "RL-1069",
        "original_report": "microscopy: There are fragmented fragments of esophageal mucosa partly lined with squamous epithelium and partly with gastric-type mucosa with intestinal metaplasia. In one of the biopsies, there is a focus with epithelium showing an abnormal aspect. The deepest glandular structures show enlarged and hyperchromatic nuclei.\n\nconclusion: Esophageal biopsies show squamocolumnar junction with intestinal metaplasia and locally low-grade dysplasia of columnar-type epithelium.\n\nbarrett_label: LGD",
        "generated_report": "microscopy: There are mucosal fragments partly lined with squamous and largely with gastric cardia-type mucosa with intestinal metaplasia and mild to moderate chronic inflammation. In one of the biopsies, there is a slightly enlarged and hyperchromatic nuclei. In some places, there is a slightly enlarged and hyperchromatic nuclei. In some places, there is a slightly enlarged and hyperchromatic nuclei. In some places, there is a slightly enlarged and hyperchromatic nuclei. In some places, there is a slightly enlarged and hyperchromatic nuclei. In some places, there is a slightly enlarged and hyperchromatic nuclei. In some places, there is a slightly enlarged and hyperchromatic nuclei. In some places, there is a slightly enlarged and hyperchromatic nuclei. In some places, there is a slightly enlarged and hyperchromatic nuclei. In some places, there is a slightly enlarged and hyperchromatic nuclei. In some places, there is a slightly enlarged and hyperchromatic nuclei. In some places, there is a slightly enlarged and hyperchromatic nuclei. In some places, there is a slightly enlarged and hyperchromatic nuclei. In some places, there is a slightly enlarged and hyperchromatic nuclei. In some places, there is a preference for a reactive cell picture and low-grade dysplasia.\n\nbarrett_label: LGD",
        "report_extracted_label": "LGD"
    },
    {
        "case_id": "RL-1070",
        "original_report": "microscopy: There are fragments of gastric-type mucosa with intestinal metaplasia. One fragment has a clearly abnormal appearance with variation in shape and size of glandular structures and abnormal epithelial lining. The nuclear features are elongated, hyperchromatic, and show stratification. Additionally, there are polymorphic forms and loss of polarity. Differential diagnosis considers low-grade and high-grade dysplasia. Due to tangential sectioning, the assessment is complicated, but there is a preference for high-grade dysplasia.\n\nconclusion: Esophageal biopsies show gastric-type mucosa with intestinal metaplasia and high-grade dysplasia.\n\nbarrett_label: HGD",
        "generated_report": "microscopy: I: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes, no dysplasia. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes, no dysplasia. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes, no dysplasia. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes, no dysplasia. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes, no dysplasia. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes, no dysplasia. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes, no dysplasia. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes, no dysplasia. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes, no dysplasia. \nII: Columnar mucosa with intestinal metaplasia and reactive epithelial changes, no dysplasia. \nII: Columnar mucosa with intestinal metaplasia and reactive epithelial changes, no dysplasia. \nII: Columnar mucosa with intestinal metaplasia and reactive epithelial changes, no dysplasia. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes, no dysplasia. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes, no dysplasia. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes, no dysplasia. \nII: fragments of gastric cardia-type mucosa",
        "report_extracted_label": "HGD"
    },
    {
        "case_id": "RL-1071",
        "original_report": "microscopy: I shows a squamocolumnar junction with squamous epithelium and gastric-type mucosa. There is minimal intestinal metaplasia and no dysplasia. In II and III, there are mucosal fragments largely lined with intestinal metaplastic mucosa and partly with squamous epithelium. The squamous epithelium shows extensive reactive changes, including spongiosis. The stroma appears to be activated with some stranding and infiltrate. Differential diagnosis considers reactive cell changes with active inflammation versus a neoplastic epithelial component. There is a preference for a reactive cell picture. PAS-D staining shows no fungus. p53 staining is wildtype.\n\nconclusion: I esophageal biopsies: squamocolumnar junction with minimal intestinal metaplasia, no dysplasia. II and III esophageal biopsies: squamocolumnar junction with intestinal metaplasia and limited active inflammation, with epithelial changes best classified as indefinite for dysplasia, with a preference for a reactive picture.\n\nbarrett_label: IND",
        "generated_report": "microscopy: There are mucosal fragments partly lined with squamous and largely with gastric cardia-type mucosa with intestinal metaplasia and partly with squamous epithelium. There is a preference for low-grade dysplasia.\n\nconclusion: Esophageal biopsies show squamocolumnar junction with intestinal metaplasia and low-grade dysplasia.\n\nbarrett_label: LGD",
        "report_extracted_label": "ND"
    },
    {
        "case_id": "RL-1072",
        "original_report": "microscopy: Fragmented material consisting of gastric cardia-type mucosa and squamous epithelium. There is minimal intestinal metaplasia. The fragments are partly tangentially affected, and in the lamina propria, there is moderately extensive chronic inflammation with focal activity. A small part of the epithelium shows a somewhat abnormal aspect with increased hyperchromatic nuclear appearance. In deeper sections, there is some nuclear pleomorphism, and the nuclear cytoplasmic ratio appears to be disturbed.\n\nconclusion: Esophageal biopsies show squamocolumnar junction with intestinal metaplasia and chronic and active inflammation. Locally, the epithelium shows features best classified as low-grade dysplasia.\n\nbarrett_label: LGD",
        "generated_report": "microscopy: I: fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. Locally, there is a small cluster of glandular structures with lining epithelium shows enlarged and hyperchromatic nuclei. In some places, there is a small cluster of glandular structures with lining epithelium shows enlarged and hyperchromatic nuclei. In some places, there is a small cluster of glandular structures with lining epithelium shows enlarged and hyperchromatic nuclei. In some places, there is a small cluster of glandular structures with lining epithelium shows enlarged and hyperchromatic nuclei. In some places, there is a small cluster of glandular structures with lining epithelium shows enlarged and hyperchromatic nuclei. In some places, there is a small cluster of glandular structures with lining epithelium shows enlarged and hyperchromatic nuclei. In some places, there is a small cluster of glandular structures with lining epithelium shows enlarged and hyperchromatic nuclei with a disturbed nuclear-cytoplasmic ratio. However, and III, IV, IV, IV, IV, IV, IV, V: fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. In one biopsy, there is a preference for a reactive cell picture and low-grade dysplasia.\n\nconclusion: I and IV esophageal biopsies: columnar mucosa with intestinal metaplasia and focal active inflammation. In one biopsy, there is a small cluster of glandular structures with limited abnormal nuclear pattern with a single mitosis. \nII: Fragments of gastric cardia-type mucosa with mild chronic inflammation, no intestinal metaplasia, no dysplasia. \nII: Fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. In one biopsy, there is a small cluster of glandular structures with",
        "report_extracted_label": "LGD"
    },
    {
        "case_id": "RL-1073",
        "original_report": "microscopy: I shows a fragment of gastric antrum-type mucosa with a partially altered appearance. Here, there is epithelium with increased nuclear density and varying chromasia. Also, basophilia of the cytoplasm. There is limited active inflammation. The stromal background shows some fibrosis. This is an altered picture where differential diagnosis considers a neoplastic and reactive cell image. There are partially pronounced epithelial changes, but also a gradient in the changes appears to be present. The number favors a reactive cell image. \nII fragments of squamocolumnar junction with intestinal metaplasia and local stacking of elongated nuclear image. Concerns the squamocolumnar junction. Favoring a reactive cell image.\n\nconclusion: I gastric antrum biopsies: gastric antrum-type mucosa with pronounced reactive and regenerative epithelial changes. \nII esophageal biopsies: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes.\n\nbarrett_label: ND",
        "generated_report": "microscopy: I: fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. Locally, there is a circumscribed focus of glandular structures with a slightly enlarged and hyperchromatic nuclei. II shows fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. Locally, there is a circumscribed focus of glandular structures with a slightly enlarged and hyperchromatic nuclei. II shows fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. Locally, there is a circumscribed focus of glandular structures with a slightly enlarged and hyperchromatic nuclei. II shows fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. Locally, there is a circumscribed focus of glandular structures with a slightly enlarged and hyperchromatic nuclei. In the lamina propria, there is a circumscribed focus of glandular structures with a slightly enlarged and hyperchromatic nuclei. In the lamina propria, there is a circumscribed focus of glandular structures with a slightly enlarged and hyperchromatic nuclei. In the lamina propria, there is a circumscribed focus of glandular structures with enlarged and hyperchromatic nuclei. In the lamina propria, there is a circumscribed focus of glandular structures with a slightly enlarged and hyperchromatic nuclei. In the lamina propria, there is a circumscribed focus of glandular structures with a slightly enlarged and hyperchromatic nuclei. In the lamina propria, there is a circumscribed focus of glandular structures with a slightly enlarged and hyperchromatic nuclei. II shows fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes.\n\nconclusion: Esophageal biopsies show columnar mucosa with intestinal metaplasia and reactive epithelial changes.\n\nbarrett_label: LGD",
        "report_extracted_label": "ND"
    },
    {
        "case_id": "RL-1074",
        "original_report": "microscopy: There are fragments of gastric cardia-type mucosa with extensive intestinal metaplasia. There is some active inflammation and complex glandular formations interpreted as reactive. In one of the biopsies, there is an abnormal nuclear appearance of the lining epithelium, including nuclear enlargement, hyperchromasia, and some loss of polarity. Extensive background reactive changes make an abrupt transition difficult to assess, with locally more apparent abnormalities.\n\nconclusion: Esophageal biopsies show gastric-type mucosa with intestinal metaplasia and locally low-grade dysplasia. The background shows some active inflammation.\n\nbarrett_label: LGD",
        "generated_report": "microscopy: I: fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. In one biopsy, there is a compact and more complex arrangement. The squamous epithelium shows a pronounced aspect. Deeper in the glands, particularly in the glandular layer. There is a preference for low-grade dysplasia.\n\nconclusion: I and IV esophageal biopsies: columnar mucosa with intestinal metaplasia and reactive epithelial changes. II: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. II: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. II: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. No dysplasia is identified.\n\nbarrett_label: LGD",
        "report_extracted_label": "LGD"
    },
    {
        "case_id": "RL-1099",
        "original_report": "microscopy: There are multiple mucosal fragments, partly lined with squamous and partly with gastric-type mucosa, showing varying degrees of intestinal metaplasia. The background includes active inflammation and ulceration. An abnormal epithelial component is present, characterized by stacking of enlarged, hyperchromatic, and slightly irregularly shaped nuclei. Locally, increased architectural complexity is noted, sometimes resembling a cribriform arrangement, though largely attributed to tangential sectioning. Partly strong cytonuclear polymorphism is observed, with intra-epithelial granulocytes present at these sites.\n\nconclusion: Esophageal biopsies show squamocolumnar junction with low-grade dysplasia of columnar-type epithelium, in the setting of intestinal metaplasia, inflammation, and ulceration.\n\nbarrett_label: LGD",
        "generated_report": "microscopy: There are mucosal fragments partly lined with squamous and largely with gastric cardia-type mucosa with intestinal metaplasia and partly with intestinal metaplastic mucosa. There is a fairly extensive abnormal aspect of the epithelium with slightly enlarged and hyperchromatic nuclei. In some biopsies, there is a slightly abnormal aspect of the epithelium with slightly enlarged and hyperchromatic nuclei. In some biopsies, there is a slightly abnormal aspect of the epithelium with slightly enlarged and hyperchromatic nuclei. In some biopsies, there is a slightly abnormal aspect of the nuclear appearance of the epithelium is slightly enlarged and hyperchromatic nuclei. In some biopsies, there is a slightly abnormal aspect of the epithelium with slightly enlarged and hyperchromatic nuclei. In some biopsies, there is a slightly abnormal aspect of the nuclear image. The polarity is observed, which in I and IV, and II esophageal biopsies partly lined with squamous and gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: Esophageal biopsies show squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. \nII: Esophageal biopsies show squamocolumnar junction with intestinal metaplasia and low-grade dysplasia.\n\nbarrett_label: LGD",
        "report_extracted_label": "LGD"
    },
    {
        "case_id": "RL-1076",
        "original_report": "microscopy: In V to VIII, there is a consistent picture of fragmented gastric-type mucosa. There is a morphologically difficult-to-interpret biopsy, particularly changes in the foveolar layer, characterized by some nuclear enlargement and nuclear stratification. In some of the biopsies, there are architectural variations of microcystic dilated glands lined with cubic epithelium with a more strongly disturbed nuclear-cytoplasmic ratio in the foveolar layer. Intestinal metaplasia is only observable in a few places. The epithelial abnormalities and foveolar layers appear to be most pronounced in VII. Immunohistochemical examination for p53, performed elsewhere, shows a strengthened staining, particularly in V, VII, and VIII, and in the foveolar layer. The location of the staining is abnormal, though not certain to classify as overexpression.\n\nconclusion: V to VIII esophageal biopsies show gastric-type mucosa with difficult-to-interpret epithelial changes, where differential diagnosis considers a reactive cell picture and dysplasia. All in all, there is a preference to consider the abnormalities as dysplasia, with exact grading uncertain.\n\nbarrett_label: HGD",
        "generated_report": "microscopy: I: fragments of gastric cardia-type mucosa with limited intestinal metaplasia and focally with intestinal metaplasia and a clear disordered arrangement of the nuclear image. The lining of the lining epithelium shows enlarged and slightly hyperchromatic nuclei. II shows gastric-type mucosa without abnormalities. II: fragmented mucosa partly lined with squamous and partly with gastric cardia-type mucosa with a limited degree of intestinal metaplasia and active inflammation. II: fragmented mucosa partly lined with squamous and partly with gastric cardia-type mucosa with a limited degree of intestinal metaplasia and active inflammation. II: fragmented mucosa, partly lined with squamous and partly with gastric cardia-type mucosa with limited intestinal metaplasia and epithelial changes best classified as indefinite for dysplasia.\n\nconclusion: Esophageal biopsies show gastric-type mucosa with intestinal metaplasia and reactive epithelial changes.\n\nbarrett_label: LGD",
        "report_extracted_label": "HGD"
    },
    {
        "case_id": "RL-1077",
        "original_report": "microscopy: Sections through tissue fragments partly lined with squamous, partly with gastric-type, and partly with intestinal metaplastic mucosa. There is predominantly an organoid arrangement and maturation, with some chronic and active inflammation in the background. In one biopsy, there is a cluster of glandular structures where the lining epithelium shows enlarged, irregularly shaped nuclei with disturbed chromasia and arrangement.\n\nconclusion: Esophageal biopsies show squamocolumnar junction with intestinal metaplasia and focal (at least) low-grade dysplasia.\n\nbarrett_label: LGD",
        "generated_report": "microscopy: There are mucosal fragments partly lined with squamous and largely of gastric cardia-type mucosa with intestinal metaplasia and partly with squamous epithelium. In one of the biopsies, there is a transition to squamous to glandular layer with an abnormal aspect with more closely packed and show stacking of elongated and hyperchromatic nuclei. In some places, there is a transition to squamous to glandular structures lined with squamous and regularly arranged nuclear pattern. Differential diagnosis considers a neoplastic lesion where the and maturation. The gastric-type mucosa shows mild chronic and active inflammation and reactive epithelial changes.\n\nconclusion: Esophageal biopsies show squamocolumnar junction with intestinal metaplasia and low-grade dysplasia.\n\nbarrett_label: LGD",
        "report_extracted_label": "LGD"
    },
    {
        "case_id": "RL-1078",
        "original_report": "microscopy: Partly fragmented esophageal mucosa biopsies are partly lined with squamous epithelium and largely with gastric-type mucosa with varying degrees of intestinal metaplasia on a background of mild chronic inflammation. There is a fragment with morphologically more pronounced abnormalities showing cell-rich and vascular stroma with admixture of neutrophilic granulocytes and some activity. Epithelial changes are present where the differential diagnosis considers reactive changes in inflammation and regeneration versus neoplasia (low-grade dysplasia). Given the regenerative stromal and epithelial changes in the presence of active inflammation, there is some preference for a reactive picture, however, no certain diagnosis.\n\nconclusion: Esophageal biopsies show squamocolumnar junction with intestinal metaplasia, active inflammation, and epithelial changes best classified as indefinite for dysplasia.\n\nbarrett_label: IND",
        "generated_report": "microscopy: I: fragmented mucosal fragments lined with squamous and largely with gastric cardia-type mucosa with intestinal metaplasia and a fragment of squamous epithelium. In one of the biopsies, there is a corresponding picture indefinite for dysplasia.\n\nconclusion: I and II esophageal biopsies: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. In one of the biopsies, there is a corresponding picture indefinite for dysplasia.\n\nconclusion: I and II esophageal biopsies: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. In one of the biopsies, there is a corresponding picture indefinite for dysplasia.\n\nconclusion: I and II esophageal biopsies: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: Squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. \nII: Squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. \nII: Squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. \nII: Squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with mild chronic and active inflammation and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and a fragment of squamous epithelium. A portion of the epithelium shows an abnormal aspect with and in the glandular layer, some stacking of elongated and hyperchromatic",
        "report_extracted_label": "ND"
    },
    {
        "case_id": "RL-1079",
        "original_report": "microscopy: I1 shows mucosal fragments partly lined with squamous and partly with gastric-type mucosa, with a pronounced foveolar layer and mild to moderate chronic inflammation. No intestinal metaplasia. II shows mucosal fragments lined with squamous and gastric-type mucosa with moderately extensive intestinal metaplasia. There is tangential sectioning and regeneration. A few glands show slightly enlarged and hyperchromatic nuclei. Intraluminally, there are cell clusters with angular and hyperchromatic nuclei, with uncertain tissue context and vitality. III shows mucosal fragments lined with gastric corpus and cardia-type mucosa and squamous epithelium. No intestinal metaplasia or dysplasia. IV shows a similar picture to III, with more pronounced regeneration in one biopsy.\n\nconclusion: Esophageal biopsies I to IV show squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. II biopsies show pronounced reactive epithelial changes. I, III, and IV biopsies show columnar mucosa and squamocolumnar junction with reactive changes.\n\nbarrett_label: ND",
        "generated_report": "microscopy: There are mucosal fragments partly lined with squamous and largely with gastric cardia-type mucosa with intestinal metaplasia and partly with gastric cardia-type mucosa with intestinal metaplasia and partly with intestinal metaplasia and reactive epithelial changes.\n\n present. In two of the biopsies, there is a slightly abnormal aspect of the epithelium with stacking of elongated and hyperchromatic nuclei. In some places, there is a slightly abnormal aspect of the epithelium with stacking of elongated and hyperchromatic nuclei. In some places, there is a slightly abnormal aspect of the epithelium with stacking of elongated and hyperchromatic nuclei. In some places, there is a slightly abnormal aspect of the epithelium with stacking of elongated and hyperchromatic nuclei. In some places, there is a slightly abnormal aspect of the epithelium with stacking of elongated and hyperchromatic nuclei, some stacking of elongated and hyperchromatic nuclei. In some places, there is a slightly abnormal aspect of the nuclear image. The maturation is difficult to assess due to tangential sectioning and mechanical damage. II shows fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes.\n\nbarrett_ of mucinous epithelium. II: Fragments of one biopsy showing multiple glandular structures, the lining epithelium shows an abnormal aspect with stacking of elongated and hyperchromatic nuclei. In some places, there is a slightly abnormal aspect of the nuclear image. \nV: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes.\n\nconclusion: Esophageal biopsies show columnar mucosa with intestinal metaplasia and reactive epithelial changes.\n\nconclusion: Esophageal biopsies show columnar mucosa with intestinal metaplasia and reactive epithelial changes.\n\nconclusion: Esophageal biopsies show",
        "report_extracted_label": "ND"
    },
    {
        "case_id": "RL-1080",
        "original_report": "microscopy: I through III show fragmented biopsy material with gastric-type mucosa with varying degrees of intestinal metaplasia and a background of mild chronic and focal active inflammation. In IV, there is a part of the epithelium with a more morphologically abnormal picture, including nuclear stratification, hyperchromatic and slightly enlarged nuclei. Stromal changes with vascular congestion and thin-walled vascular structures are also present. Differential diagnosis considers reactive epithelial changes during regeneration and low-grade dysplasia. No certain distinction is made. \n\nThe panel assessment concluded that I-III show gastric-type mucosa with varying degrees of intestinal metaplasia, chronic and active inflammation, and reactive epithelial changes. IV shows gastric-type mucosa with intestinal metaplasia and more pronounced epithelial changes, best classified as indefinite for dysplasia.\n\nconclusion: I-III esophageal biopsies show gastric-type mucosa with varying degrees of intestinal metaplasia, chronic and active inflammation, and reactive epithelial changes. IV biopsy shows more pronounced epithelial changes, best classified as indefinite for dysplasia.\n\nbarrett_label: IND",
        "generated_report": "microscopy: I shows fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. II shows fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. II shows fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. II shows fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. II shows fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. II shows fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. II shows fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. II shows fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. II shows fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. IV shows fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. IV shows fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. IV shows fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. IV shows fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. IV shows gastric cardia-type mucosa with intestinal metaplasia and low-grade dysplasia.\n\nbarrett_label: LGD",
        "report_extracted_label": "ND"
    },
    {
        "case_id": "RL-1081",
        "original_report": "microscopy: Fragmented mucosal biopsies are partly lined with squamous and largely with gastric-type mucosa. Here and there, there is a varying degree of intestinal metaplasia. The background shows regeneration with partly pronounced flat and reactive changes and a vascular aspect of the lamina propria. A single fragment shows the lining epithelium with elongation, pseudostratification, and some loss of polarity.\n\nconclusion: Esophageal biopsies show squamocolumnar junction with low-grade dysplasia of columnar epithelium. The background includes intestinal metaplasia and reactive changes.\n\nbarrett_label: LGD",
        "generated_report": "microscopy: I: fragments of gastric cardia-type mucosa with intestinal metaplasia and a picture suspicious appearance. Part of the biopsies is tangentially affected and there is a corresponding picture is seen. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. II and IV show columnar mucosa with intestinal metaplasia and high-grade dysplasia.\n\nbarrett_label: HGD",
        "report_extracted_label": "LGD"
    },
    {
        "case_id": "RL-1082",
        "original_report": "microscopy: The material was reviewed in the context of panel evaluation (LANS case 1082): II shows gastric-type mucosa with intestinal metaplasia and chronic active inflammation, no dysplasia. III shows squamocolumnar junction with intestinal metaplasia, chronic active inflammation, and epithelial changes. IV shows squamocolumnar junction with intestinal metaplasia and mild chronic inflammation with low-grade dysplasia of columnar-type epithelium.\n\nconclusion: Esophageal biopsies show gastric-type mucosa with intestinal metaplasia and reactive epithelial changes, no dysplasia in I and II. III shows squamocolumnar junction with intestinal metaplasia, chronic active inflammation, and epithelial changes classified as low-grade dysplasia. IV shows squamocolumnar junction with intestinal metaplasia and mild chronic inflammation with low-grade dysplasia of columnar-type epithelium.\n\nbarrett_label: LGD",
        "generated_report": "microscopy: I: fragmented mucosal fragments lined with squamous and largely with gastric cardia-type mucosa with intestinal metaplasia and mild to moderate chronic inflammation. Locally, there is a circumscribed cluster of glandular structures with a slightly enlarged and hyperchromatic nuclei. In some places, there is a circumscribed cluster of glandular structures with a slightly enlarged and hyperchromatic nuclei. In some places, there is a circumscribed cluster of glandular structures with a slightly enlarged and hyperchromatic nuclei. In some places, there is a reactive cell picture.\n\nconclusion: I to VI esophageal biopsies: columnar mucosa with intestinal metaplasia and reactive epithelial changes. II shows fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. IV esophageal biopsies: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. IV esophageal biopsies: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. IV esophageal biopsies with intestinal metaplasia and mild chronic inflammation. In one biopsy, there is a reactive cell picture.\n\nconclusion: I and IV esophageal biopsies: columnar mucosa with intestinal metaplasia and low-grade dysplasia.\n\nconclusion: I to III esophageal biopsies with intestinal metaplasia and reactive epithelial changes. IV esophageal biopsies: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. IV esophageal biopsies partly lined with squamous and partly with gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and mild to moderate chronic inflammation. II shows fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. II shows fragments of gastric cardia-type mucosa with limited intestinal metaplasia and mild chronic inflammation. II",
        "report_extracted_label": "LGD"
    },
    {
        "case_id": "RL-1083",
        "original_report": "microscopy: The material shows a squamocolumnar junction with intestinal metaplasia and inflammation. High-grade dysplasia of columnar-type epithelium is identified. The panel assessment (LANS case 1083) concluded high-grade dysplasia (4 out of 5 pathologists).\n\nconclusion: Esophageal biopsies show squamocolumnar junction with intestinal metaplasia and inflammation, and high-grade dysplasia of columnar-type epithelium.\n\nbarrett_label: HGD",
        "generated_report": "microscopy: I: fragments of gastric corpus-type mucosa without abnormalities. II: Fragments of gastric cardia-type mucosa with intestinal metaplasia and partly with squamous epithelium. There is a preference for a reactive cell picture and nuclear features. Differential diagnosis considers low-grade dysplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and partly with squamous epithelium. There is a preference for a reactive cell picture. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: Fragments of gastric cardia-type mucosa with intestinal metaplasia and partly with squamous epithelium. There is a preference for a reactive cell picture. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nIII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. II esophageal biopsies: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. II esophageal biopsies: squamocolumnar",
        "report_extracted_label": "HGD"
    },
    {
        "case_id": "RL-1084",
        "original_report": "microscopy: Fragmented mucosal biopsies at the level of the squamocolumnar junction show varying degrees of intestinal metaplasia. There is a background of mild chronic active inflammation and regeneration. Some biopsies are affected by tangential sectioning, making evaluation more difficult. In deeper sections, the findings are consistent with regeneration. There are areas with disturbed nuclear-cytoplasmic ratio that are difficult to correlate morphologically.\n\nconclusion: Esophageal biopsies show squamocolumnar junction with intestinal metaplasia and local epithelial changes, best classified as low-grade dysplasia.\n\nbarrett_label: LGD",
        "generated_report": "microscopy: I shows fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes.\n\nconclusion: I: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes.\n\nconclusion: I: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes.\n\nconclusion: I: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes.\n\nconclusion: I: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes.\n\nconclusion: I: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes.\n\nconclusion: I: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes.\n\nconclusion: I: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes.\n\nconclusion: I: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes.\n\nconclusion: I: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes.\n\nbarrett_label: LGD",
        "report_extracted_label": "LGD"
    },
    {
        "case_id": "RL-1085",
        "original_report": "microscopy: I shows fragmented mucosal fragments partly consisting of gastric corpus and cardia-type mucosa and partly lined with squamous epithelium. No intestinal metaplasia or dysplasia is identified. II shows gastric-type mucosa with fairly extensive intestinal metaplasia and focal squamous epithelial lining. In one biopsy, there is a morphologically distinct area in the presence of chronic active inflammation and regeneration. Several closely packed glandular structures are seen, with the lining epithelium showing a disturbed nuclear-cytoplasmic ratio. There is active inflammation with a fibrinopurulent coating. Differential diagnosis considers reactive changes versus a neoplastic epithelial component (low-grade vs. high-grade dysplasia).\n\nconclusion: I esophageal biopsies: squamocolumnar junction with mild chronic inflammation, no intestinal metaplasia or dysplasia. II esophageal biopsies: squamocolumnar junction with intestinal metaplasia and chronic active inflammation. Epithelial changes are best classified as low-grade dysplasia.\n\nbarrett_label: LGD",
        "generated_report": "microscopy: There are mucosal fragments partly lined with squamous and largely with gastric cardia-type mucosa with intestinal metaplasia and mild to moderately extensive chronic inflammation. In one of the biopsies, there is a slightly enlarged nuclear appearance. III shows fragments at the site of the squamocolumnar junction with intestinal metaplasia and reactive epithelial changes.\n\nconclusion: Esophageal biopsies show columnar mucosa with intestinal metaplasia and low-grade dysplasia.\n\nbarrett_label: LGD",
        "report_extracted_label": "LGD"
    },
    {
        "case_id": "RL-1086",
        "original_report": "microscopy: I shows fragments of gastric-type mucosa with extensive intestinal metaplasia. The biopsies are somewhat darkly discolored, and in one of the biopsies, a circumscript focus of glandular structures is seen, where the lining epithelium shows a slightly enlarged, hyperchromatic nuclear appearance. \nII shows fragments of gastric-cardia-type mucosa with a varying degree of intestinal metaplasia.\n\nconclusion: Esophageal biopsies show gastric-type mucosa with intestinal metaplasia. I shows low-grade dysplasia. II shows reactive epithelial changes.\n\nbarrett_label: LGD",
        "generated_report": "microscopy: I: fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. In one biopsy, there is a corresponding picture is seen. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. In one biopsy, there is a corresponding picture is seen. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. In one biopsy, there is a corresponding picture is seen. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. In one biopsy, there is a corresponding picture is seen. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. In one biopsy, there is a corresponding picture is seen. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. In one biopsy, there is a corresponding picture is seen. \nII: Columnar mucosa with intestinal metaplasia and reactive epithelial changes. \nII: Columnar mucosa with intestinal metaplasia and reactive epithelial changes. \nII: Columnar mucosa with intestinal metaplasia and reactive epithelial changes. \nII: Columnar mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. In one biopsy, there is a corresponding picture is seen. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. II: fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. II: fragments of gastric cardia-type mucosa with intestinal metaplasia",
        "report_extracted_label": "LGD"
    },
    {
        "case_id": "RL-1087",
        "original_report": "microscopy: I shows fragments of gastric cardia-type mucosa with varying degrees of intestinal metaplasia. II and III show a similar picture, each with a small focus of some hyperchromasia and nuclear stacking.\n\nconclusion: I esophageal biopsy: gastric-type mucosa with intestinal metaplasia, no dysplasia. II and III biopsies: gastric-type mucosa with intestinal metaplasia and low-grade dysplasia.\n\nbarrett_label: LGD",
        "generated_report": "microscopy: I: fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. In one biopsy, there is a preference for low-grade dysplasia.\n\nconclusion: I and IV esophageal biopsies: columnar mucosa with intestinal metaplasia and reactive epithelial changes. II: Fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. In one biopsy, there is a preference for low-grade dysplasia.\n\nconclusion: I and IV esophageal biopsies: columnar mucosa with intestinal metaplasia and reactive epithelial changes. II: Fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. In one biopsy, there is a preference for low-grade dysplasia.\n\nconclusion: I and IV esophageal biopsies: columnar mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. In one biopsy, there is a preference for low-grade dysplasia.\n\nconclusion: I esophageal biopsies: gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. In one biopsy, there is a preference for a reactive cell picture.\n\nconclusion: I esophageal biopsies of the squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. No dysplasia is identified.\n\nbarrett_label: LGD",
        "report_extracted_label": "LGD"
    },
    {
        "case_id": "RL-1088",
        "original_report": "microscopy: In agreement with colleague, there are fragments at the level of the squamocolumnar junction with gastric cardia-type mucosa, partly with an abnormal aspect. In a part of the biopsies, there is an abnormal aspect with densely packed glandular structures and elongation and stratification of the nuclear image. In addition, there is a disturbed nuclear-cytoplasmic ratio and increased atypia. Also present is mild chronic and active inflammation. Differential diagnosis considers reactive changes versus dysplasia. Given the architectural complexity and cytonuclear atypia, the findings favor dysplasia, leaning towards high-grade dysplasia. \n\nAdditionally, the case was reviewed in the context of panel evaluation (LANS/DEPP case 1088) with the conclusion: squamocolumnar junction with intestinal metaplasia and (at least) low-grade dysplasia (5x LGD, 5x HGD).\n\nconclusion: Esophageal biopsies show squamocolumnar junction with intestinal metaplasia and (at least) low-grade dysplasia.\n\nbarrett_label: HGD",
        "generated_report": "microscopy: I: Fragments of gastric corpus and cardia-type mucosa with limited intestinal metaplasia. II shows fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes.\n\nconclusion: I to III esophageal biopsies: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes.\n\nconclusion: I and IV, and IV, and IV, and IV, and IV, and IV, and IV, and IV, and IV, and IV, and IV, and IV, and IV, and IV, and IV, and IV, and IV epithelium. There is a moderately dense round-cell inflammatory infiltrate is present. In one biopsy, there is a small cluster of glandular structures with lining epithelium shows enlarged and hyperchromatic nuclei. In the deeper sections, maturation may be reconstructed and III esophageal biopsies: gastric-type mucosa biopsies: gastric-type mucosa biopsies: gastric-type mucosa biopsies: gastric-type mucosa biopsies: gastric-type mucosa biopsies: gastric-type mucosa biopsies with intestinal metaplasia and reactive epithelial changes.\n\nbarrett_label: LGD",
        "report_extracted_label": "HGD"
    },
    {
        "case_id": "RL-1089",
        "original_report": "microscopy: I shows fragmented mucosal biopsies with a fairly extensive neoplastic epithelial component, foveolar dysplasia where differential diagnosis considers low-grade and high-grade dysplasia. There is focal intestinal metaplasia. II and III show biopsies of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes.\n\nconclusion: I esophageal biopsies: squamocolumnar junction with limited intestinal metaplasia and at least low-grade dysplasia of columnar mucosa. II and III esophageal biopsies: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes, no dysplasia identified.\n\nbarrett_label: LGD",
        "generated_report": "microscopy: There are mucosal fragments partly lined with squamous and largely with gastric cardia-type mucosa with intestinal metaplasia. There is a background of mild chronic and active inflammation and reactive epithelial changes.\n\nconclusion: Esophageal biopsies show squamocolumnar junction with intestinal metaplasia and low-grade dysplasia.\n\nbarrett_label: LGD",
        "report_extracted_label": "LGD"
    },
    {
        "case_id": "RL-1090",
        "original_report": "microscopy: Fragmented and tangentially sectioned gastric-type mucosa fragments show a pronounced superficial layer with extensive morphological abnormalities in the form of elongated nuclear images. Stratification in the form of multilayering is consistent with foveolar dysplasia. II shows the squamocolumnar junction with reactive changes.\n\nconclusion: I and II esophageal biopsies distal:\nI esophageal biopsies, Z-line: gastric-type mucosa with at least low-grade (foveolar) dysplasia; the cellular image is striking and difficult to exactly grade, with high-grade dysplasia not being excluded.\nII esophageal biopsies distal: squamocolumnar junction with reactive epithelial changes and mild intestinal metaplasia, with no dysplasia identified.\n\nbarrett_label: LGD",
        "generated_report": "microscopy: I shows fragmented mucosal fragments lined with columnar-type epithelium with goblet cells. There is a cribriform arrangement and morphological aspect of the surface. Part of the biopsies. The epithelium shows elongation and a pseudo-stratified nuclear-cytoplasmic ratio. The differential diagnosis considers low-grade and high-grade dysplasia are considered diagnostic options.\n\nconclusion: I and III esophageal biopsies: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. In one of the biopsies, there is a corresponding appearance. A similar image is seen, and the picture is seen with some microcystic dilatations in the glandular layer. In one of the biopsies show squamocolumnar junction with intestinal metaplasia and low-grade dysplasia.\n\nbarrett_label: HGD",
        "report_extracted_label": "HGD"
    },
    {
        "case_id": "RL-1091",
        "original_report": "microscopy: In I, there is the squamocolumnar junction with gastric-type mucosa showing reactive changes and mild chronic inflammation, no intestinal metaplasia, and no dysplasia. \nIn II, there are fragments of gastric-type mucosa with intestinal metaplasia. There is mild chronic inflammation, and the background shows reactive stromal changes. The fragments are tangentially affected, and in one place, there are a few glandular structures with a slightly enlarged and elongated nuclear appearance. Morphologically, there are no clear abrupt cytonuclear changes. \nIn III, there is the squamocolumnar junction with limited intestinal metaplasia. The material is tangentially affected and shows a few glandular structures with a slightly enlarged and hyperchromatic nuclear appearance. The maturation is intact.\n\nconclusion: I and III esophageal biopsies: squamocolumnar junction with mild chronic inflammation and intestinal metaplasia and reactive epithelial changes. \nII esophageal biopsies: mucosa with intestinal metaplasia and, locally, a small loose tissue fragment, best classified as indefinite for dysplasia.\n\nbarrett_label: IND",
        "generated_report": "microscopy: I shows fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. Locally, there is a preference for high-grade dysplasia.\n\nconclusion: I and IV esophageal biopsies: columnar mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and mild inflammation. Locally, there is a preference for high-grade dysplasia.\n\nconclusion: I and IV esophageal biopsies: columnar mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. Locally, there is a preference for high-grade dysplasia.\n\nconclusion: I and IV esophageal biopsies: columnar mucosa with intestinal metaplasia and reactive epithelial changes. \nII shows fragments of gastric cardia-type mucosa with intestinal metaplasia and mild inflammation. In one biopsy, there is a preference for high-grade dysplasia.\n\nbarrett_label: LGD",
        "report_extracted_label": "ND"
    },
    {
        "case_id": "RL-1092",
        "original_report": "microscopy: I shows fragmented pieces of gastric corpus and gastric cardia-type mucosa with a limited degree of intestinal metaplasia and mild to moderate chronic inflammation. II shows fragments at the site of the squamocolumnar junction with intestinal metaplasia of gastric-type mucosa and moderate chronic inflammation. III shows fragments of esophageal mucosa partly lined with tubular structures and partly with gastric-type mucosa with intestinal metaplasia.\n\nconclusion: I and III esophageal biopsies show squamocolumnar junction and gastric-type mucosa with intestinal metaplasia and mild chronic inflammation, with no dysplasia identified. II esophageal biopsies show squamocolumnar junction with intestinal metaplasia and focal epithelial changes best classified as indefinite for dysplasia.\n\nbarrett_label: IND",
        "generated_report": "microscopy: I shows fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. Locally, there is a slightly pronounced aspect of the foveolar layer and some stacking and elongation of the nuclear image. Differential diagnosis considers low-grade dysplasia and a reactive cell picture and low-grade dysplasia.\n\nconclusion: I and III show gastric-type mucosa with intestinal metaplasia and low-grade dysplasia.\n\nbarrett_label: LGD",
        "report_extracted_label": "ND"
    },
    {
        "case_id": "RL-1093",
        "original_report": "microscopy: In I and II, there are fragments of gastric-type mucosa with a varying degree of chronic focal active inflammation. In III through V, a largely similar picture is observed with, in addition to intestinal metaplasia, some morphological abnormalities. These include small areas with a slightly enlarged and more rounded nuclear appearance with some irregular nuclear placement. The biopsies are partly tangentially affected, with no clear morphological jump. \n\nAddendum: The material has also been reviewed in the context of panel assessment (LANS/DEPP 1093): Esophageal biopsies at 34, 32, and 30 cm show gastric-type mucosa with varying degrees of intestinal metaplasia and chronic inflammation, sometimes with extensive morphological changes, classifiable as reactive (6/6 pathologists, no dysplasia).\n\nconclusion: Esophageal biopsies show gastric-type mucosa with varying degrees of intestinal metaplasia and chronic inflammation. Some biopsies exhibit morphological changes that are classifiable as reactive, with no evidence of dysplasia identified.\n\nbarrett_label: ND",
        "generated_report": "microscopy: I: fragmented mucosal fragments lined with gastric cardia-type mucosa with intestinal metaplasia and a portion of the epithelium with a slightly enlarged and slightly hyperchromatic nuclei. There is a pronounced aspect of the foveolar layer. The lining epithelium shows elongated and hyperchromatic nuclei. There is a pronounced aspect of the foveolar layer. The lining epithelium shows elongated and hyperchromatic nuclei. There is a varying degree of intestinal metaplasia. There is a varying degree of intestinal metaplasia. There is a varying degree of intestinal metaplasia. There is a pronounced aspect of the foveolar layer. The lining epithelium shows elongated and stratified nuclear appearance. The lining epithelium shows elongated and hyperchromatic nuclei. There is a varying degree of intestinal metaplasia. There is a pronounced aspect of the foveolar layer. Here, where the nuclear pattern. The maturation towards the surface is not always well assessable. II - IV show reactive epithelial changes and no dysplasia. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. IV esophageal biopsies show columnar mucosa with intestinal metaplasia and reactive epithelial changes. IV esophageal biopsies: gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. IV esophageal biopsies partly tangentially affected and shows glandular structures with enlarged and slightly hyperchromatic nuclei. There is a pronounced aspect of the foveolar layer. Here, where the nuclear pattern and disturbed nuclear-cytoplasmic ratio. Differential diagnosis considers low-grade and high-grade dysplasia.\n\nconclusion: Esophageal biopsies show gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. In one biopsy, there is a preference for high-grade abnormality.\n\nbarrett_label: LGD",
        "report_extracted_label": "ND"
    },
    {
        "case_id": "RL-1094",
        "original_report": "microscopy: In II, there are mucosal fragments, focally lined with squamous and largely with gastric-type mucosa with intestinal metaplasia. Scattered are fairly extensive reactive epithelial changes. Several places show a slightly increased and hyperchromatic nuclear appearance. Part of this epithelial component is located as loose epithelial fragments. In III and IV, there is a similar picture of fragments of gastric-type mucosa with intestinal metaplasia, occasionally also some squamous epithelium.\n\nconclusion: II-IV Esophageal biopsies: II fragments of esophagus and gastric-type mucosa with mild chronic inflammation and intestinal metaplasia. Local epithelial changes best classified as low-grade dysplasia. III fragments show epithelial changes best classified as indefinite for dysplasia. IV fragments show gastric-type mucosa with intestinal metaplasia and mild chronic inflammation.\n\nbarrett_label: LGD",
        "generated_report": "microscopy: I: Fragments at the site of the squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. II: Fragments at the site of the squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. \nIII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nIII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nIII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nIII: Columnar mucosa with intestinal metaplasia and reactive epithelial changes. \nIII: Columnar mucosa with intestinal metaplasia and reactive epithelial changes. \nIII: Columnar mucosa with intestinal metaplasia and reactive epithelial changes. \nIII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nIII: fragments of gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nVI: Fragments at the site of the squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. II: Fragments at the site of the squamocolumnar junction with intestinal metaplasia and reactive epithelial changes",
        "report_extracted_label": "LGD"
    },
    {
        "case_id": "RL-1095",
        "original_report": "microscopy: II and III show fragments of gastric-type mucosa with varying extensive intestinal metaplasia. Scattered throughout the biopsies are reactive epithelial changes. In addition, there are a few clusters of glands where the lining epithelium shows a somewhat hyperchromatic and enlarged nuclear appearance.\n\nconclusion: II esophageal biopsy: gastric-type mucosa with intestinal metaplasia and epithelial changes indefinite for dysplasia, with some preference for a reactive cell image. III esophageal biopsies: gastric-type mucosa with intestinal metaplasia and local epithelial changes, best classified as indefinite for dysplasia.\n\nbarrett_label: IND",
        "generated_report": "microscopy: I: fragmented mucosal fragments lined with gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. Locally, there is a corresponding picture indefinite for dysplasia. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. Locally, there is a corresponding picture indefinite for dysplasia. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. Locally, there is a corresponding picture indefinite for dysplasia. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. Locally, there is a corresponding picture indefinite for dysplasia. \nIII: fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. In one biopsy, there is a corresponding picture indefinite for dysplasia. \nIII: fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. In one biopsy, there is a corresponding picture indefinite for dysplasia. \nIII: Columnar mucosa with intestinal metaplasia and reactive epithelial changes. \nIII: Columnar mucosa with intestinal metaplasia and reactive epithelial changes. \nIII: Columnar mucosa with intestinal metaplasia and reactive epithelial changes. \nIII: fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. In one biopsy, there is a corresponding picture indefinite for dysplasia. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. In one of the biopsies. The epithelium shows elevation and hyperchromasia. The the epithelium shows elevation and hyperchromasia.",
        "report_extracted_label": "ND"
    },
    {
        "case_id": "RL-1096",
        "original_report": "microscopy: In agreement with colleague elsewhere, in I to III there are tissue fragments partly lined with squamous and partly with gastric-type mucosa with intestinal metaplasia. Reactive changes are present. In II, there are four tissue fragments largely lined with gastric-type mucosa and partly with squamous epithelium. In the background, there is intestinal metaplasia and reactive epithelial and stromal changes. A circumscript focus of glandular structures shows lining epithelium with enlarged, irregular, and hyperchromatic nuclear features.\n\nconclusion: I esophageal biopsy: squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. II esophageal biopsies: squamocolumnar junction with intestinal metaplasia and locally low-grade dysplasia of columnar-type epithelium.\n\nbarrett_label: LGD",
        "generated_report": "microscopy: There are mucosal fragments partly lined with squamous and partly with gastric cardia-type mucosa with intestinal metaplasia and partly with squamous epithelium. A part of the epithelium shows an abnormal aspect with an abrupt transition observed. The fragment is tangentially sectioned, making interpretation difficult to assess due to tangential sectioning and damage.\n\nconclusion: Esophageal biopsies show squamocolumnar junction with intestinal metaplasia and low-grade dysplasia.\n\nbarrett_label: LGD",
        "report_extracted_label": "LGD"
    },
    {
        "case_id": "RL-1097",
        "original_report": "microscopy: In I, there are tissue fragments entirely lined with gastric-type mucosa with extensive intestinal metaplasia. In one of the biopsies, there is a circumscribed abnormal focus in the glandular layer where the lining epithelium shows a hyperchromatic nuclear pattern. II shows fragments of esophageal mucosa partly lined with squamous and partly with gastric-type mucosa with intestinal metaplasia. There is varying, partly extensive chronic inflammation and reactive epithelial stromal changes.\n\nconclusion: I esophageal biopsies: gastric-type mucosa with intestinal metaplasia and low-grade dysplasia. II esophageal biopsies: squamocolumnar junction with intestinal metaplasia and partly extensive chronic inflammation. No dysplasia.\n\nbarrett_label: LGD",
        "generated_report": "microscopy: I shows fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. Locally, there is a slightly enlarged and hyperchromatic nuclei. In some places, there is a slightly enlarged and hyperchromatic nuclei. In some places, there is a slightly enlarged and hyperchromatic nuclei. In some places, there is a slightly enlarged and hyperchromatic nuclei. In some places, there is a slightly enlarged and hyperchromatic nuclei. There is a preference for low-grade dysplasia.\n\nconclusion: I and IV esophageal biopsies: columnar mucosa with intestinal metaplasia and reactive epithelial changes. II shows fragments of gastric cardia-type mucosa with intestinal metaplasia and mild chronic inflammation. Locally, there is a preference for low-grade dysplasia.\n\nconclusion: I and IV esophageal biopsies show columnar mucosa with intestinal metaplasia and low-grade dysplasia.\n\nbarrett_label: LGD",
        "report_extracted_label": "LGD"
    },
    {
        "case_id": "RL-1098",
        "original_report": "microscopy: I shows a tangentially affected fragment of gastric-type mucosa with intestinal metaplasia. In the background, there is mild chronic focal active inflammation and some fibrosis in the lamina propria. The epithelium along the foveolar layer shows reactive changes with an intact mucous layer and is multiple layers thick. Locally, some stacking with hyperchromasia and polymorphism. II shows a more pronounced picture with multiple clusters of glands, the lining epithelium of which shows a clearly enlarged and hyperchromatic nuclear appearance. There is intestinal metaplasia and focal increased polymorphism. Due to tangential sectioning, the image is not optimally assessable; however, given the loss of polarity and strong polymorphism, there is a preference for high-grade dysplasia.\n\nconclusion: I esophageal biopsies: gastric-type mucosa with limited intestinal metaplasia and low-grade dysplasia. II esophageal biopsies: squamocolumnar junction with intestinal metaplasia and a preference for high-grade dysplasia.\n\nbarrett_label: HGD",
        "generated_report": "microscopy: I shows fragments of gastric cardia-type mucosa with intestinal metaplasia and a fragment of squamous epithelium. There is a preference for high-grade dysplasia.\n\nconclusion: I and IV esophageal biopsies: columnar mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and a fragment of squamous epithelium. There is a preference for high-grade dysplasia.\n\nconclusion: I and IV esophageal biopsies: columnar mucosa with intestinal metaplasia and reactive epithelial changes. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and a fragment of squamous epithelium. There is a preference for high-grade dysplasia.\n\nconclusion: I and IV esophageal biopsies show low-grade dysplastic columnar mucosa with intestinal metaplasia and low-grade dysplasia.\n\nbarrett_label: LGD",
        "report_extracted_label": "HGD"
    },
    {
        "case_id": "RL-1099",
        "original_report": "microscopy: There are multiple mucosal fragments, partly lined with squamous and partly with gastric-type mucosa, showing varying degrees of intestinal metaplasia. The background includes active inflammation and ulceration. An abnormal epithelial component is present, characterized by stacking of enlarged, hyperchromatic, and slightly irregularly shaped nuclei. Locally, increased architectural complexity is noted, sometimes resembling a cribriform arrangement, though largely attributed to tangential sectioning. Partly strong cytonuclear polymorphism is observed, with intra-epithelial granulocytes present at these sites.\n\nconclusion: Esophageal biopsies show squamocolumnar junction with low-grade dysplasia of columnar-type epithelium, in the setting of intestinal metaplasia, inflammation, and ulceration.\n\nbarrett_label: LGD",
        "generated_report": "microscopy: There are mucosal fragments partly lined with squamous and largely with gastric cardia-type mucosa with intestinal metaplasia and partly with intestinal metaplastic mucosa. There is a fairly extensive abnormal aspect of the epithelium with slightly enlarged and hyperchromatic nuclei. In some biopsies, there is a slightly abnormal aspect of the epithelium with slightly enlarged and hyperchromatic nuclei. In some biopsies, there is a slightly abnormal aspect of the epithelium with slightly enlarged and hyperchromatic nuclei. In some biopsies, there is a slightly abnormal aspect of the nuclear appearance of the epithelium is slightly enlarged and hyperchromatic nuclei. In some biopsies, there is a slightly abnormal aspect of the epithelium with slightly enlarged and hyperchromatic nuclei. In some biopsies, there is a slightly abnormal aspect of the nuclear image. The polarity is observed, which in I and IV, and II esophageal biopsies partly lined with squamous and gastric cardia-type mucosa with intestinal metaplasia and reactive epithelial changes. \nII: Esophageal biopsies show squamocolumnar junction with intestinal metaplasia and reactive epithelial changes. \nII: Esophageal biopsies show squamocolumnar junction with intestinal metaplasia and low-grade dysplasia.\n\nbarrett_label: LGD",
        "report_extracted_label": "LGD"
    },
    {
        "case_id": "RL-1100",
        "original_report": "microscopy: In I to V, there are multiple mucosal fragments largely consisting of gastric-type mucosa with varying degrees of intestinal metaplasia and partly lined with squamous epithelium. There is mild chronic inflammation with varying degrees of stromal and epithelial reactive changes. In I, there is a notably abnormal architecture, partly pronounced by tangential sectioning. A papillomatous aspect and lumina with serrated, micropapillary, and cribriform-appearing epithelial arrangement are observed. The lining epithelium shows slightly enlarged, irregularly shaped nuclei with some stacking. The cytoplasm varies from basophilic to eosinophilic. Differential diagnosis considers regenerative epithelial reaction and neoplastic proliferation. In II, there is focal abnormal mucosa with a less pronounced image, preferably classified as low-grade dysplasia.\n\nconclusion: I to V esophageal biopsies show columnar mucosa with intestinal metaplasia and reactive epithelial changes. I contains abnormal glandular mucosa with an unusual serrated pattern, difficult to grade exactly, with high-grade dysplasia not excluded. II contains similar but less pronounced focal dysplasia. III-V show no dysplasia.\n\nbarrett_label: HGD",
        "generated_report": "microscopy: I: fragmented mucosal fragments lined with columnar-type epithelium, gastric cardia-type mucosa shows a difficult-to-interpret image. \nII: fragments of gastric cardia-type mucosa with intestinal metaplasia and a small differentiation jump, but not well assessable. In a few places, there is a corresponding picture.\n\nconclusion: I area with low-grade dysplasia, and a pronounced aspect of the foveolar layer. The lining epithelium shows elongated and stratified nuclear pattern. Differential diagnosis considers low-grade and high-grade dysplasia.\n\nconclusion: I and IV esophageal biopsies show columnar mucosa with intestinal metaplasia and low-grade dysplasia.\n\nbarrett_label: LGD",
        "report_extracted_label": "HGD"
    }
]